HloModule cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_173__XlaNumResourceArgs_52_.2592

%max_half_.303 (x.304: f16[], y.305: f16[]) -> f16[] {
  %x.304 = f16[] parameter(0)
  %y.305 = f16[] parameter(1)
  ROOT %maximum.306 = f16[] maximum(f16[] %x.304, f16[] %y.305)
}

%add_float_.313 (x.314: f32[], y.315: f32[]) -> f32[] {
  %x.314 = f32[] parameter(0)
  %y.315 = f32[] parameter(1)
  ROOT %add.316 = f32[] add(f32[] %x.314, f32[] %y.315)
}

%max_half_.479 (x.480: f16[], y.481: f16[]) -> f16[] {
  %x.480 = f16[] parameter(0)
  %y.481 = f16[] parameter(1)
  ROOT %maximum.482 = f16[] maximum(f16[] %x.480, f16[] %y.481)
}

%add_float_.489 (x.490: f32[], y.491: f32[]) -> f32[] {
  %x.490 = f32[] parameter(0)
  %y.491 = f32[] parameter(1)
  ROOT %add.492 = f32[] add(f32[] %x.490, f32[] %y.491)
}

%gradient_tape_model_bert_pretrainer_bert_encoder_1_transformer_layer_1_self_attention_softmax_Sum-reduction.1341 (x.1342: f32[], y.1343: f32[]) -> f32[] {
  %x.1342 = f32[] parameter(0)
  %y.1343 = f32[] parameter(1)
  ROOT %add.1344 = f32[] add(f32[] %x.1342, f32[] %y.1343)
}

%gradient_tape_model_bert_pretrainer_bert_encoder_1_transformer_layer_0_self_attention_softmax_Sum-reduction.1599 (x.1600: f32[], y.1601: f32[]) -> f32[] {
  %x.1600 = f32[] parameter(0)
  %y.1601 = f32[] parameter(1)
  ROOT %add.1602 = f32[] add(f32[] %x.1600, f32[] %y.1601)
}

%Mean-reduction.942 (x.943: f32[], y.944: f32[]) -> f32[] {
  %x.943 = f32[] parameter(0)
  %y.944 = f32[] parameter(1)
  ROOT %add.945 = f32[] add(f32[] %x.943, f32[] %y.944)
}

%fused_computation (param_0: f32[], param_1.1314: f32[], param_2.886: f32[], param_3.686: f32[], param_4.536: f32[], param_5.457: f32[], param_6.524: f32[], param_7.448: f32[]) -> (f32[], f32[], f32[], f32[]) {
  %param_0 = f32[] parameter(0)
  %param_1.1314 = f32[] parameter(1)
  %constant_70 = f32[] constant(0.0625)
  %multiply.326 = f32[] multiply(f32[] %param_1.1314, f32[] %constant_70), metadata={op_type="Mean" op_name="model/bert_pretrain_loss_and_metric_layer/Mean"}
  %param_3.686 = f32[] parameter(3)
  %constant_71 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %compare.118 = pred[] compare(f32[] %param_3.686, f32[] %constant_71), direction=EQ, metadata={op_type="DivNoNan" op_name="gradient_tape/model/bert_pretrain_loss_and_metric_layer/div_no_nan/div_no_nan"}
  %param_2.886 = f32[] parameter(2)
  %divide.88 = f32[] divide(f32[] %param_2.886, f32[] %param_3.686), metadata={op_type="DivNoNan" op_name="model/bert_pretrain_loss_and_metric_layer/div_no_nan"}
  %select.114 = f32[] select(pred[] %compare.118, f32[] %constant_71, f32[] %divide.88), metadata={op_type="DivNoNan" op_name="model/bert_pretrain_loss_and_metric_layer/div_no_nan"}
  %add.8 = f32[] add(f32[] %multiply.326, f32[] %select.114), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add"}
  %broadcast.223 = f32[16]{0} broadcast(f32[] %add.8), dimensions={}
  %reduce.112 = f32[] reduce(f32[16]{0} %broadcast.223, f32[] %constant_71), dimensions={0}, to_apply=%Mean-reduction.942, metadata={op_type="Mean" op_name="Mean"}
  %multiply.95 = f32[] multiply(f32[] %reduce.112, f32[] %constant_70), metadata={op_type="Mean" op_name="Mean"}
  %add.7 = f32[] add(f32[] %param_0, f32[] %multiply.95), metadata={op_type="AssignAddVariableOp" op_name="AssignAddVariableOp"}
  %param_4.536 = f32[] parameter(4)
  %add.456.clone.1 = f32[] add(f32[] %param_4.536, f32[] %select.114), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_2"}
  %param_5.457 = f32[] parameter(5)
  %add.85.clone.1 = f32[] add(f32[] %param_5.457, f32[] %multiply.326), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_6"}
  %param_6.524 = f32[] parameter(6)
  %param_7.448 = f32[] parameter(7)
  %constant_66_clone_1 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add_1"}
  %add.10.clone.1 = f32[] add(f32[] %param_3.686, f32[] %constant_66_clone_1), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add_1"}
  %divide.0.clone.1 = f32[] divide(f32[] %param_7.448, f32[] %add.10.clone.1), metadata={op_type="RealDiv" op_name="model/bert_pretrain_loss_and_metric_layer/truediv"}
  %add.9.clone.1 = f32[] add(f32[] %param_6.524, f32[] %divide.0.clone.1), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp"}
  ROOT %tuple.30 = (f32[], f32[], f32[], f32[]) tuple(f32[] %add.7, f32[] %add.456.clone.1, f32[] %add.85.clone.1, f32[] %add.9.clone.1)
}

%min_S64.804 (lhs.805: s64[], rhs.806: s64[]) -> s64[] {
  %lhs.805 = s64[] parameter(0)
  %rhs.806 = s64[] parameter(1)
  ROOT %minimum.807 = s64[] minimum(s64[] %lhs.805, s64[] %rhs.806)
}

%fused_computation.3 (param_0.1186: f32[16,76], param_1.1325: f32[30522], param_2.894: f16[1216,30528]) -> s64[16,76] {
  %param_2.894 = f16[1216,30528]{1,0} parameter(2)
  %slice.37 = f16[1216,30522]{1,0} slice(f16[1216,30528]{1,0} %param_2.894), slice={[0:1216], [0:30522]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/cls/predictions/MatMul"}
  %param_1.1325 = f32[30522]{0} parameter(1)
  %convert.671 = f16[30522]{0} convert(f32[30522]{0} %param_1.1325), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/BiasAdd/Cast"}
  %broadcast.1800 = f16[1216,30522]{1,0} broadcast(f16[30522]{0} %convert.671), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %add.461 = f16[1216,30522]{1,0} add(f16[1216,30522]{1,0} %slice.37, f16[1216,30522]{1,0} %broadcast.1800), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %convert.670 = f32[1216,30522]{1,0} convert(f16[1216,30522]{1,0} %add.461), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast_1"}
  %bitcast.472 = f32[16,76,30522]{2,1,0} bitcast(f32[1216,30522]{1,0} %convert.670), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_1"}
  %param_0.1186 = f32[16,76]{1,0} parameter(0)
  %broadcast.226 = f32[16,76,30522]{2,1,0} broadcast(f32[16,76]{1,0} %param_0.1186), dimensions={0,1}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %compare.1 = pred[16,76,30522]{2,1,0} compare(f32[16,76,30522]{2,1,0} %bitcast.472, f32[16,76,30522]{2,1,0} %broadcast.226), direction=EQ, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %iota.0 = s64[16,76,30522]{2,1,0} iota(), iota_dimension=2, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %constant_73 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %broadcast.225 = s64[16,76,30522]{2,1,0} broadcast(s64[] %constant_73), dimensions={}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %select.20 = s64[16,76,30522]{2,1,0} select(pred[16,76,30522]{2,1,0} %compare.1, s64[16,76,30522]{2,1,0} %iota.0, s64[16,76,30522]{2,1,0} %broadcast.225), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  ROOT %reduce.114 = s64[16,76]{1,0} reduce(s64[16,76,30522]{2,1,0} %select.20, s64[] %constant_73), dimensions={2}, to_apply=%min_S64.804, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
}

%add_float_.763 (x.764: f32[], y.765: f32[]) -> f32[] {
  %x.764 = f32[] parameter(0)
  %y.765 = f32[] parameter(1)
  ROOT %add.766 = f32[] add(f32[] %x.764, f32[] %y.765)
}

%fused_computation.7 (param_0.1063: f32[1216], param_1.1166: s32[16,76], param_2.706: f32[1216], param_3.484: f32[30522], param_4.339: f16[1216,30528]) -> f32[1216] {
  %param_1.1166 = s32[16,76]{1,0} parameter(1)
  %convert.271 = f32[16,76]{1,0} convert(s32[16,76]{1,0} %param_1.1166), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_2"}
  %convert.270 = s64[16,76]{1,0} convert(f32[16,76]{1,0} %convert.271), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_3"}
  %bitcast.318 = s64[1216]{0} bitcast(s64[16,76]{1,0} %convert.270), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_3"}
  %broadcast.608 = s64[1216,30522]{1,0} broadcast(s64[1216]{0} %bitcast.318), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.6 = s64[1216,30522]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.35 = pred[1216,30522]{1,0} compare(s64[1216,30522]{1,0} %broadcast.608, s64[1216,30522]{1,0} %iota.6), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_418 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.607 = f32[1216,30522]{1,0} broadcast(f32[] %constant_418), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_76 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.606 = f32[1216,30522]{1,0} broadcast(f32[] %constant_76), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.50 = f32[1216,30522]{1,0} select(pred[1216,30522]{1,0} %compare.35, f32[1216,30522]{1,0} %broadcast.607, f32[1216,30522]{1,0} %broadcast.606), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_416 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.604 = s64[1216]{0} broadcast(s64[] %constant_416), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.34 = pred[1216]{0} compare(s64[1216]{0} %broadcast.604, s64[1216]{0} %bitcast.318), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_414 = s64[] constant(30522), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.603 = s64[1216]{0} broadcast(s64[] %constant_414), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.33 = pred[1216]{0} compare(s64[1216]{0} %bitcast.318, s64[1216]{0} %broadcast.603), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %and.93 = pred[1216]{0} and(pred[1216]{0} %compare.34, pred[1216]{0} %compare.33), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.602 = f32[1216]{0} broadcast(f32[] %constant_76), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_413 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.601 = f32[1216]{0} broadcast(f32[] %constant_413), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.49 = f32[1216]{0} select(pred[1216]{0} %and.93, f32[1216]{0} %broadcast.602, f32[1216]{0} %broadcast.601), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.599 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %select.49), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %add.93 = f32[1216,30522]{1,0} add(f32[1216,30522]{1,0} %select.50, f32[1216,30522]{1,0} %broadcast.599), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.0 = f32[1216,30522]{1,0} negate(f32[1216,30522]{1,0} %add.93), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_4.339 = f16[1216,30528]{1,0} parameter(4)
  %slice.23 = f16[1216,30522]{1,0} slice(f16[1216,30528]{1,0} %param_4.339), slice={[0:1216], [0:30522]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/cls/predictions/MatMul"}
  %param_3.484 = f32[30522]{0} parameter(3)
  %convert.437 = f16[30522]{0} convert(f32[30522]{0} %param_3.484), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/BiasAdd/Cast"}
  %broadcast.1321 = f16[1216,30522]{1,0} broadcast(f16[30522]{0} %convert.437), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %add.300 = f16[1216,30522]{1,0} add(f16[1216,30522]{1,0} %slice.23, f16[1216,30522]{1,0} %broadcast.1321), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %convert.436 = f32[1216,30522]{1,0} convert(f16[1216,30522]{1,0} %add.300), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast_1"}
  %param_2.706 = f32[1216]{0} parameter(2)
  %broadcast.1320 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %param_2.706), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.83 = f32[1216,30522]{1,0} subtract(f32[1216,30522]{1,0} %convert.436, f32[1216,30522]{1,0} %broadcast.1320), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.1063 = f32[1216]{0} parameter(0)
  %broadcast.227 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %param_0.1063), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.1 = f32[1216,30522]{1,0} subtract(f32[1216,30522]{1,0} %subtract.83, f32[1216,30522]{1,0} %broadcast.227), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.97 = f32[1216,30522]{1,0} multiply(f32[1216,30522]{1,0} %negate.0, f32[1216,30522]{1,0} %subtract.1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %reduce.116 = f32[1216]{0} reduce(f32[1216,30522]{1,0} %multiply.97, f32[] %constant_76), dimensions={1}, to_apply=%add_float_.763, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
}

%model_bert_pretrain_loss_and_metric_layer_Sum_6-reduction.862 (x.863: f32[], y.864: f32[]) -> f32[] {
  %x.863 = f32[] parameter(0)
  %y.864 = f32[] parameter(1)
  ROOT %add.865 = f32[] add(f32[] %x.863, f32[] %y.864)
}

%fused_computation.8 (param_0.13: f32[], param_1.637: s32[16,1], param_2.253: s64[16]) -> f32[] {
  %param_0.13 = f32[] parameter(0)
  %param_2.253 = s64[16]{0} parameter(2)
  %convert.28 = s32[16]{0} convert(s64[16]{0} %param_2.253), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_11"}
  %param_1.637 = s32[16,1]{1,0} parameter(1)
  %bitcast.168 = s32[16]{0} bitcast(s32[16,1]{1,0} %param_1.637), metadata={op_type="Squeeze" op_name="model/bert_pretrain_loss_and_metric_layer/Squeeze"}
  %compare.2 = pred[16]{0} compare(s32[16]{0} %convert.28, s32[16]{0} %bitcast.168), direction=EQ, metadata={op_type="Equal" op_name="model/bert_pretrain_loss_and_metric_layer/Equal_1"}
  %convert.27 = f32[16]{0} convert(pred[16]{0} %compare.2), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_12"}
  %constant_77 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %reduce.117 = f32[] reduce(f32[16]{0} %convert.27, f32[] %constant_77), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_6-reduction.862, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_6"}
  ROOT %add.11 = f32[] add(f32[] %param_0.13, f32[] %reduce.117), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_4"}
}

%min_S64.851 (lhs.852: s64[], rhs.853: s64[]) -> s64[] {
  %lhs.852 = s64[] parameter(0)
  %rhs.853 = s64[] parameter(1)
  ROOT %minimum.854 = s64[] minimum(s64[] %lhs.852, s64[] %rhs.853)
}

%fused_computation.9 (param_0.1094: f32[16], param_1.1196: f32[2], param_2.748: f16[16,8]) -> s64[16] {
  %param_2.748 = f16[16,8]{1,0} parameter(2)
  %slice.27 = f16[16,2]{1,0} slice(f16[16,8]{1,0} %param_2.748), slice={[0:16], [0:2]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/classification/predictions/transform/logits/MatMul"}
  %param_1.1196 = f32[2]{0} parameter(1)
  %convert.506 = f16[2]{0} convert(f32[2]{0} %param_1.1196), metadata={op_type="Cast" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd/Cast"}
  %broadcast.1412 = f16[16,2]{1,0} broadcast(f16[2]{0} %convert.506), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %add.318 = f16[16,2]{1,0} add(f16[16,2]{1,0} %slice.27, f16[16,2]{1,0} %broadcast.1412), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %convert.29 = f32[16,2]{1,0} convert(f16[16,2]{1,0} %add.318), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_4"}
  %param_0.1094 = f32[16]{0} parameter(0)
  %broadcast.337 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_0.1094), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.3 = pred[16,2]{1,0} compare(f32[16,2]{1,0} %convert.29, f32[16,2]{1,0} %broadcast.337), direction=EQ, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %iota.1 = s64[16,2]{1,0} iota(), iota_dimension=1, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %constant_78 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %broadcast.228 = s64[16,2]{1,0} broadcast(s64[] %constant_78), dimensions={}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %select.22 = s64[16,2]{1,0} select(pred[16,2]{1,0} %compare.3, s64[16,2]{1,0} %iota.1, s64[16,2]{1,0} %broadcast.228), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  ROOT %reduce.118 = s64[16]{0} reduce(s64[16,2]{1,0} %select.22, s64[] %constant_78), dimensions={1}, to_apply=%min_S64.851, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
}

%model_bert_pretrain_loss_and_metric_layer_Mean-reduction.927 (x.928: f32[], y.929: f32[]) -> f32[] {
  %x.928 = f32[] parameter(0)
  %y.929 = f32[] parameter(1)
  ROOT %add.930 = f32[] add(f32[] %x.928, f32[] %y.929)
}

%fused_computation.10 (param_0.1102: f32[16], param_1.1207: s32[16,1], param_2.760: f32[16], param_3.542: f32[2], param_4.397: f16[16,8]) -> f32[] {
  %param_1.1207 = s32[16,1]{1,0} parameter(1)
  %convert.498 = f32[16,1]{1,0} convert(s32[16,1]{1,0} %param_1.1207), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_5"}
  %convert.497 = s64[16,1]{1,0} convert(f32[16,1]{1,0} %convert.498), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_6"}
  %bitcast.366 = s64[16]{0} bitcast(s64[16,1]{1,0} %convert.497), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_6"}
  %broadcast.1392 = s64[16,2]{1,0} broadcast(s64[16]{0} %bitcast.366), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.14 = s64[16,2]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.91 = pred[16,2]{1,0} compare(s64[16,2]{1,0} %broadcast.1392, s64[16,2]{1,0} %iota.14), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_968 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1391 = f32[16,2]{1,0} broadcast(f32[] %constant_968), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_80 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.1390 = f32[16,2]{1,0} broadcast(f32[] %constant_80), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %select.90 = f32[16,2]{1,0} select(pred[16,2]{1,0} %compare.91, f32[16,2]{1,0} %broadcast.1391, f32[16,2]{1,0} %broadcast.1390), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_966 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1389 = s64[16]{0} broadcast(s64[] %constant_966), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.90 = pred[16]{0} compare(s64[16]{0} %broadcast.1389, s64[16]{0} %bitcast.366), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_965 = s64[] constant(2), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1388 = s64[16]{0} broadcast(s64[] %constant_965), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.89 = pred[16]{0} compare(s64[16]{0} %bitcast.366, s64[16]{0} %broadcast.1388), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %and.101 = pred[16]{0} and(pred[16]{0} %compare.90, pred[16]{0} %compare.89), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1387 = f32[16]{0} broadcast(f32[] %constant_80), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_964 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1386 = f32[16]{0} broadcast(f32[] %constant_964), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %select.89 = f32[16]{0} select(pred[16]{0} %and.101, f32[16]{0} %broadcast.1387, f32[16]{0} %broadcast.1386), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1385 = f32[16,2]{1,0} broadcast(f32[16]{0} %select.89), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %add.311 = f32[16,2]{1,0} add(f32[16,2]{1,0} %select.90, f32[16,2]{1,0} %broadcast.1385), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.1 = f32[16,2]{1,0} negate(f32[16,2]{1,0} %add.311), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_4.397 = f16[16,8]{1,0} parameter(4)
  %slice.33 = f16[16,2]{1,0} slice(f16[16,8]{1,0} %param_4.397), slice={[0:16], [0:2]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/classification/predictions/transform/logits/MatMul"}
  %param_3.542 = f32[2]{0} parameter(3)
  %convert.519 = f16[2]{0} convert(f32[2]{0} %param_3.542), metadata={op_type="Cast" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd/Cast"}
  %broadcast.1424 = f16[16,2]{1,0} broadcast(f16[2]{0} %convert.519), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %add.324 = f16[16,2]{1,0} add(f16[16,2]{1,0} %slice.33, f16[16,2]{1,0} %broadcast.1424), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %convert.518 = f32[16,2]{1,0} convert(f16[16,2]{1,0} %add.324), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_4"}
  %param_2.760 = f32[16]{0} parameter(2)
  %broadcast.1422 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_2.760), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.91 = f32[16,2]{1,0} subtract(f32[16,2]{1,0} %convert.518, f32[16,2]{1,0} %broadcast.1422), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.1102 = f32[16]{0} parameter(0)
  %broadcast.229 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_0.1102), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.2 = f32[16,2]{1,0} subtract(f32[16,2]{1,0} %subtract.91, f32[16,2]{1,0} %broadcast.229), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.98 = f32[16,2]{1,0} multiply(f32[16,2]{1,0} %negate.1, f32[16,2]{1,0} %subtract.2), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %bitcast.169 = f32[32]{0} bitcast(f32[16,2]{1,0} %multiply.98)
  ROOT %reduce.119 = f32[] reduce(f32[32]{0} %bitcast.169, f32[] %constant_80), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Mean-reduction.927, metadata={op_type="Mean" op_name="model/bert_pretrain_loss_and_metric_layer/Mean"}
}

%All_40-reduction.2342 (x.2343: pred[], y.2344: pred[]) -> pred[] {
  %x.2343 = pred[] parameter(0)
  %y.2344 = pred[] parameter(1)
  ROOT %and.2345 = pred[] and(pred[] %x.2343, pred[] %y.2344)
}

%fused_computation.11 (param_0.619: pred[], param_1.643: pred[], param_2.256: pred[], param_3.171: pred[], param_4.78: pred[], param_5.56: f32[2], param_6.49: pred[], param_7.44: pred[], param_8.47: pred[], param_9.25: pred[], param_10.12: pred[], param_11.9: pred[], param_12.11: pred[], param_13.10: pred[], param_14.11: pred[], param_15.12: pred[], param_16.14: pred[], param_17.8: pred[], param_18.4: pred[], param_19.4: pred[], param_20.4: pred[], param_21.4: pred[], param_22.4: pred[], param_23.4: pred[], param_24.4: pred[], param_25.4: pred[], param_26.4: pred[], param_27.4: pred[], param_28.4: pred[], param_29.4: pred[], param_30.4: pred[], param_31.4: pred[], param_32.4: pred[], param_33.4: pred[], param_34.4: pred[], param_35.4: pred[], param_36.4: pred[], param_37.4: pred[], param_38.4: pred[], param_39.4: pred[], param_40.4: pred[], param_41.4: pred[], param_42.4: pred[], param_43.4: pred[], param_44.4: pred[], param_45.4: pred[]) -> pred[] {
  %param_44.4 = pred[] parameter(44)
  %param_45.4 = pred[] parameter(45)
  %and.89 = pred[] and(pred[] %param_44.4, pred[] %param_45.4)
  %param_43.4 = pred[] parameter(43)
  %and.88 = pred[] and(pred[] %and.89, pred[] %param_43.4)
  %param_42.4 = pred[] parameter(42)
  %and.87 = pred[] and(pred[] %and.88, pred[] %param_42.4)
  %param_41.4 = pred[] parameter(41)
  %and.86 = pred[] and(pred[] %and.87, pred[] %param_41.4)
  %param_40.4 = pred[] parameter(40)
  %and.85 = pred[] and(pred[] %and.86, pred[] %param_40.4)
  %param_39.4 = pred[] parameter(39)
  %and.84 = pred[] and(pred[] %and.85, pred[] %param_39.4)
  %param_38.4 = pred[] parameter(38)
  %and.83 = pred[] and(pred[] %and.84, pred[] %param_38.4)
  %param_37.4 = pred[] parameter(37)
  %and.82 = pred[] and(pred[] %and.83, pred[] %param_37.4)
  %param_36.4 = pred[] parameter(36)
  %and.81 = pred[] and(pred[] %and.82, pred[] %param_36.4)
  %param_35.4 = pred[] parameter(35)
  %and.80 = pred[] and(pred[] %and.81, pred[] %param_35.4)
  %param_34.4 = pred[] parameter(34)
  %and.79 = pred[] and(pred[] %and.80, pred[] %param_34.4)
  %param_33.4 = pred[] parameter(33)
  %and.78 = pred[] and(pred[] %and.79, pred[] %param_33.4)
  %param_32.4 = pred[] parameter(32)
  %and.77 = pred[] and(pred[] %and.78, pred[] %param_32.4)
  %param_31.4 = pred[] parameter(31)
  %and.76 = pred[] and(pred[] %and.77, pred[] %param_31.4)
  %param_30.4 = pred[] parameter(30)
  %and.75 = pred[] and(pred[] %and.76, pred[] %param_30.4)
  %param_29.4 = pred[] parameter(29)
  %and.74 = pred[] and(pred[] %and.75, pred[] %param_29.4)
  %param_28.4 = pred[] parameter(28)
  %and.73 = pred[] and(pred[] %and.74, pred[] %param_28.4)
  %param_27.4 = pred[] parameter(27)
  %and.72 = pred[] and(pred[] %and.73, pred[] %param_27.4)
  %param_26.4 = pred[] parameter(26)
  %and.71 = pred[] and(pred[] %and.72, pred[] %param_26.4)
  %param_25.4 = pred[] parameter(25)
  %and.70 = pred[] and(pred[] %and.71, pred[] %param_25.4)
  %param_24.4 = pred[] parameter(24)
  %and.69 = pred[] and(pred[] %and.70, pred[] %param_24.4)
  %param_23.4 = pred[] parameter(23)
  %and.68 = pred[] and(pred[] %and.69, pred[] %param_23.4)
  %param_22.4 = pred[] parameter(22)
  %and.67 = pred[] and(pred[] %and.68, pred[] %param_22.4)
  %param_21.4 = pred[] parameter(21)
  %and.66 = pred[] and(pred[] %and.67, pred[] %param_21.4)
  %param_20.4 = pred[] parameter(20)
  %and.65 = pred[] and(pred[] %and.66, pred[] %param_20.4)
  %param_19.4 = pred[] parameter(19)
  %and.64 = pred[] and(pred[] %and.65, pred[] %param_19.4)
  %param_18.4 = pred[] parameter(18)
  %and.63 = pred[] and(pred[] %and.64, pred[] %param_18.4)
  %param_17.8 = pred[] parameter(17)
  %and.62 = pred[] and(pred[] %and.63, pred[] %param_17.8)
  %param_16.14 = pred[] parameter(16)
  %and.61 = pred[] and(pred[] %and.62, pred[] %param_16.14)
  %param_15.12 = pred[] parameter(15)
  %and.60 = pred[] and(pred[] %and.61, pred[] %param_15.12)
  %param_14.11 = pred[] parameter(14)
  %and.59 = pred[] and(pred[] %and.60, pred[] %param_14.11)
  %param_13.10 = pred[] parameter(13)
  %and.58 = pred[] and(pred[] %and.59, pred[] %param_13.10)
  %param_12.11 = pred[] parameter(12)
  %and.57 = pred[] and(pred[] %and.58, pred[] %param_12.11)
  %param_11.9 = pred[] parameter(11)
  %and.56 = pred[] and(pred[] %and.57, pred[] %param_11.9)
  %param_10.12 = pred[] parameter(10)
  %and.55 = pred[] and(pred[] %and.56, pred[] %param_10.12)
  %param_9.25 = pred[] parameter(9)
  %and.54 = pred[] and(pred[] %and.55, pred[] %param_9.25)
  %param_8.47 = pred[] parameter(8)
  %and.53 = pred[] and(pred[] %and.54, pred[] %param_8.47)
  %param_7.44 = pred[] parameter(7)
  %and.52 = pred[] and(pred[] %and.53, pred[] %param_7.44)
  %param_6.49 = pred[] parameter(6)
  %and.51 = pred[] and(pred[] %and.52, pred[] %param_6.49)
  %param_5.56 = f32[2]{0} parameter(5)
  %is-finite.0 = pred[2]{0} is-finite(f32[2]{0} %param_5.56), metadata={op_type="IsFinite" op_name="IsFinite_40"}
  %constant_81 = pred[] constant(true), metadata={op_type="All" op_name="All"}
  %reduce.120 = pred[] reduce(pred[2]{0} %is-finite.0, pred[] %constant_81), dimensions={0}, to_apply=%All_40-reduction.2342, metadata={op_type="All" op_name="All_40"}
  %and.50 = pred[] and(pred[] %and.51, pred[] %reduce.120)
  %param_4.78 = pred[] parameter(4)
  %and.49 = pred[] and(pred[] %and.50, pred[] %param_4.78)
  %param_3.171 = pred[] parameter(3)
  %and.48 = pred[] and(pred[] %and.49, pred[] %param_3.171)
  %param_2.256 = pred[] parameter(2)
  %and.47 = pred[] and(pred[] %and.48, pred[] %param_2.256)
  %param_1.643 = pred[] parameter(1)
  %and.46 = pred[] and(pred[] %and.47, pred[] %param_1.643)
  %param_0.619 = pred[] parameter(0)
  %and.45 = pred[] and(pred[] %and.46, pred[] %param_0.619), metadata={op_type="All" op_name="All_46"}
  %convert.30 = f32[] convert(pred[] %and.45), metadata={op_type="Cast" op_name="Cast"}
  %constant_82 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %compare.4 = pred[] compare(f32[] %convert.30, f32[] %constant_82), direction=EQ, metadata={op_type="Equal" op_name="Equal"}
}

%add_float_.1128 (x.1129: f32[], y.1130: f32[]) -> f32[] {
  %x.1129 = f32[] parameter(0)
  %y.1130 = f32[] parameter(1)
  ROOT %add.1131 = f32[] add(f32[] %x.1129, f32[] %y.1130)
}

%gradient_tape_model_bert_pretrainer_cls_predictions_transform_LayerNorm_batchnorm_sub_Sum-reduction.1904 (x.1905: f32[], y.1906: f32[]) -> f32[] {
  %x.1905 = f32[] parameter(0)
  %y.1906 = f32[] parameter(1)
  ROOT %add.1907 = f32[] add(f32[] %x.1905, f32[] %y.1906)
}

%gradient_tape_model_bert_pretrainer_cls_predictions_transform_LayerNorm_batchnorm_mul_Sum_1-reduction.1895 (x.1896: f32[], y.1897: f32[]) -> f32[] {
  %x.1896 = f32[] parameter(0)
  %y.1897 = f32[] parameter(1)
  ROOT %add.1898 = f32[] add(f32[] %x.1896, f32[] %y.1897)
}

%fused_computation.18 (param_0.1212: f16[1216,768], param_1.1399: f16[1216,768], param_2.938: f32[1216], param_3.742: f32[1216], param_4.611: f16[1216,768], param_5.536: f32[1216], param_6.521: f32[768], param_7.446: f32[1216], param_8.382: f16[1216,768]) -> (f32[768], f16[1216,768], f32[768], f32[768]) {
  %constant_299_clone_1 = f16[] constant(0.13416), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul_1"}
  %broadcast.271.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_299_clone_1), dimensions={}, metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul_1"}
  %param_1.1399 = f16[1216,768]{1,0} parameter(1)
  %multiply.366.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %param_1.1399, f16[1216,768]{1,0} %param_1.1399)
  %param_8.382 = f16[1216,768]{1,0} parameter(8)
  %convert.163.clone.1 = f32[1216,768]{1,0} convert(f16[1216,768]{1,0} %param_8.382), metadata={op_type="Cast" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/Cast_1/Cast"}
  %constant_890_clone_1 = f32[] constant(1e-12), metadata={op_type="AddV2" op_name="model/bert_pretrainer/bert_encoder_1/embeddings/layer_norm/batchnorm/add"}
  %broadcast.1288.clone.1 = f32[1216]{0} broadcast(f32[] %constant_890_clone_1), dimensions={}, metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/add"}
  %param_7.446 = f32[1216]{0} parameter(7)
  %constant_885_clone_1 = f32[] constant(0.00130208337), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/truediv_1"}
  %broadcast.1287.clone.1 = f32[1216]{0} broadcast(f32[] %constant_885_clone_1), dimensions={}
  %multiply.711.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %param_7.446, f32[1216]{0} %broadcast.1287.clone.1), metadata={op_type="Mean" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/variance"}
  %add.281.clone.1 = f32[1216]{0} add(f32[1216]{0} %broadcast.1288.clone.1, f32[1216]{0} %multiply.711.clone.1), metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/add"}
  %rsqrt.85.clone.1 = f32[1216]{0} rsqrt(f32[1216]{0} %add.281.clone.1), metadata={op_type="Rsqrt" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/Rsqrt"}
  %broadcast.496.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %rsqrt.85.clone.1), dimensions={0}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul"}
  %param_6.521 = f32[768]{0} parameter(6)
  %broadcast.494.clone.1 = f32[1216,768]{1,0} broadcast(f32[768]{0} %param_6.521), dimensions={1}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul"}
  %multiply.364.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %broadcast.496.clone.1, f32[1216,768]{1,0} %broadcast.494.clone.1), metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul"}
  %multiply.261.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %convert.163.clone.1, f32[1216,768]{1,0} %multiply.364.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul_1/Mul"}
  %constant_300_clone_1 = f32[] constant(2), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/Mul"}
  %broadcast.269.clone.1 = f32[1216,1]{1,0} broadcast(f32[] %constant_300_clone_1), dimensions={}
  %broadcast.268.clone.1 = f32[1216,1]{1,0} broadcast(f32[] %constant_885_clone_1), dimensions={}
  %bitcast.283.clone.1 = f32[1216,1]{1,0} bitcast(f32[1216]{0} %rsqrt.85.clone.1), metadata={op_type="Rsqrt" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/Rsqrt"}
  %multiply.260.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %bitcast.283.clone.1, f32[1216,1]{1,0} %bitcast.283.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %multiply.259.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %multiply.260.clone.1, f32[1216,1]{1,0} %bitcast.283.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %param_5.536 = f32[1216]{0} parameter(5)
  %constant_301_clone_1 = f32[] constant(-0.5)
  %broadcast.267.clone.1 = f32[1216]{0} broadcast(f32[] %constant_301_clone_1), dimensions={}
  %multiply.258.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %param_5.536, f32[1216]{0} %broadcast.267.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %bitcast.282.clone.1 = f32[1216,1]{1,0} bitcast(f32[1216]{0} %multiply.258.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %multiply.257.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %multiply.259.clone.1, f32[1216,1]{1,0} %bitcast.282.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %multiply.256.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %broadcast.268.clone.1, f32[1216,1]{1,0} %multiply.257.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/truediv"}
  %multiply.255.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %broadcast.269.clone.1, f32[1216,1]{1,0} %multiply.256.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/Mul"}
  %bitcast.281.clone.1 = f32[1216]{0} bitcast(f32[1216,1]{1,0} %multiply.255.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/Mul"}
  %broadcast.266.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %bitcast.281.clone.1), dimensions={0}
  %param_4.611 = f16[1216,768]{1,0} parameter(4)
  %convert.419.clone.1 = f32[1216,768]{1,0} convert(f16[1216,768]{1,0} %param_4.611), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/Cast"}
  %param_3.742 = f32[1216]{0} parameter(3)
  %multiply.709.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %param_3.742, f32[1216]{0} %broadcast.1287.clone.1), metadata={op_type="Mean" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/mean"}
  %broadcast.1283.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %multiply.709.clone.1), dimensions={0}, metadata={op_type="SquaredDifference" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/SquaredDifference"}
  %subtract.79.clone.1 = f32[1216,768]{1,0} subtract(f32[1216,768]{1,0} %convert.419.clone.1, f32[1216,768]{1,0} %broadcast.1283.clone.1), metadata={op_type="SquaredDifference" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/SquaredDifference"}
  %multiply.253.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %broadcast.266.clone.1, f32[1216,768]{1,0} %subtract.79.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/mul_1"}
  %add.45.clone.1 = f32[1216,768]{1,0} add(f32[1216,768]{1,0} %multiply.261.clone.1, f32[1216,768]{1,0} %multiply.253.clone.1), metadata={op_type="AddN" op_name="AddN_1"}
  %param_2.938 = f32[1216]{0} parameter(2)
  %multiply.252.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %broadcast.1287.clone.1, f32[1216]{0} %param_2.938), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/truediv_1"}
  %broadcast.264.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %multiply.252.clone.1), dimensions={0}
  %add.44.clone.1 = f32[1216,768]{1,0} add(f32[1216,768]{1,0} %add.45.clone.1, f32[1216,768]{1,0} %broadcast.264.clone.1), metadata={op_type="AddN" op_name="AddN_1"}
  %convert.162.clone.1 = f16[1216,768]{1,0} convert(f32[1216,768]{1,0} %add.44.clone.1), metadata={op_type="Cast" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/Cast/Cast"}
  %constant_303_clone_1 = f16[] constant(0.5), metadata={op_type="Mul" op_name="model/bert_pretrainer/bert_encoder_1/transformer/layer_0/activation/Gelu/mul"}
  %broadcast.498.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_303_clone_1), dimensions={}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul"}
  %multiply.365.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %param_1.1399, f16[1216,768]{1,0} %broadcast.498.clone.1), metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul"}
  %multiply.251.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %convert.162.clone.1, f16[1216,768]{1,0} %multiply.365.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_3/Mul_1"}
  %constant_306_clone_1 = f16[] constant(1), metadata={op_type="Sub" op_name="model/bert_pretrainer/bert_encoder_1/transformer/layer_1/self_attention/softmax/sub"}
  %broadcast.501.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_306_clone_1), dimensions={}, metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/add_1"}
  %param_0.1212 = f16[1216,768]{1,0} parameter(0)
  %multiply.250.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %param_0.1212, f16[1216,768]{1,0} %param_0.1212), metadata={op_type="TanhGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/TanhGrad"}
  %subtract.10.clone.1 = f16[1216,768]{1,0} subtract(f16[1216,768]{1,0} %broadcast.501.clone.1, f16[1216,768]{1,0} %multiply.250.clone.1), metadata={op_type="TanhGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/TanhGrad"}
  %multiply.249.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.251.clone.1, f16[1216,768]{1,0} %subtract.10.clone.1), metadata={op_type="TanhGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/TanhGrad"}
  %constant_305_clone_1 = f16[] constant(0.79785), metadata={op_type="Mul" op_name="model/bert_pretrainer/bert_encoder_1/transformer/layer_0/activation/Gelu/mul_2"}
  %broadcast.499.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_305_clone_1), dimensions={}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_2"}
  %multiply.248.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.249.clone.1, f16[1216,768]{1,0} %broadcast.499.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_2/Mul"}
  %multiply.247.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.366.clone.1, f16[1216,768]{1,0} %multiply.248.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul"}
  %multiply.246.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %broadcast.271.clone.1, f16[1216,768]{1,0} %multiply.247.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul_1"}
  %multiply.245.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %convert.162.clone.1, f16[1216,768]{1,0} %broadcast.498.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_3/Mul"}
