HloModule cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_120__XlaNumResourceArgs_146_.3712

%max_half_.415 (x.416: f16[], y.417: f16[]) -> f16[] {
  %x.416 = f16[] parameter(0)
  %y.417 = f16[] parameter(1)
  ROOT %maximum.418 = f16[] maximum(f16[] %x.416, f16[] %y.417)
}

%add_float_.425 (x.426: f32[], y.427: f32[]) -> f32[] {
  %x.426 = f32[] parameter(0)
  %y.427 = f32[] parameter(1)
  ROOT %add.428 = f32[] add(f32[] %x.426, f32[] %y.427)
}

%max_half_.591 (x.592: f16[], y.593: f16[]) -> f16[] {
  %x.592 = f16[] parameter(0)
  %y.593 = f16[] parameter(1)
  ROOT %maximum.594 = f16[] maximum(f16[] %x.592, f16[] %y.593)
}

%add_float_.601 (x.602: f32[], y.603: f32[]) -> f32[] {
  %x.602 = f32[] parameter(0)
  %y.603 = f32[] parameter(1)
  ROOT %add.604 = f32[] add(f32[] %x.602, f32[] %y.603)
}

%gradient_tape_model_bert_pretrainer_bert_encoder_1_transformer_layer_1_self_attention_softmax_Sum-reduction.1354 (x.1355: f32[], y.1356: f32[]) -> f32[] {
  %x.1355 = f32[] parameter(0)
  %y.1356 = f32[] parameter(1)
  ROOT %add.1357 = f32[] add(f32[] %x.1355, f32[] %y.1356)
}

%gradient_tape_model_bert_pretrainer_bert_encoder_1_transformer_layer_0_self_attention_softmax_Sum-reduction.1612 (x.1613: f32[], y.1614: f32[]) -> f32[] {
  %x.1613 = f32[] parameter(0)
  %y.1614 = f32[] parameter(1)
  ROOT %add.1615 = f32[] add(f32[] %x.1613, f32[] %y.1614)
}

%Mean-reduction.1950 (x.1951: f32[], y.1952: f32[]) -> f32[] {
  %x.1951 = f32[] parameter(0)
  %y.1952 = f32[] parameter(1)
  ROOT %add.1953 = f32[] add(f32[] %x.1951, f32[] %y.1952)
}

%fused_computation (param_0: f32[], param_1.1656: f32[], param_2.1726: f32[], param_3.1122: f32[], param_4.703: f32[], param_5.452: f32[], param_6.798: f32[], param_7.834: f32[]) -> (f32[], f32[], f32[], f32[]) {
  %param_0 = f32[] parameter(0)
  %param_1.1656 = f32[] parameter(1)
  %constant_71 = f32[] constant(0.0625)
  %multiply.519 = f32[] multiply(f32[] %param_1.1656, f32[] %constant_71), metadata={op_type="Mean" op_name="model/bert_pretrain_loss_and_metric_layer/Mean"}
  %param_3.1122 = f32[] parameter(3)
  %constant_72 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %compare.116 = pred[] compare(f32[] %param_3.1122, f32[] %constant_72), direction=EQ, metadata={op_type="DivNoNan" op_name="gradient_tape/model/bert_pretrain_loss_and_metric_layer/div_no_nan/div_no_nan"}
  %param_2.1726 = f32[] parameter(2)
  %divide.77 = f32[] divide(f32[] %param_2.1726, f32[] %param_3.1122), metadata={op_type="DivNoNan" op_name="model/bert_pretrain_loss_and_metric_layer/div_no_nan"}
  %select.114 = f32[] select(pred[] %compare.116, f32[] %constant_72, f32[] %divide.77), metadata={op_type="DivNoNan" op_name="model/bert_pretrain_loss_and_metric_layer/div_no_nan"}
  %add.8 = f32[] add(f32[] %multiply.519, f32[] %select.114), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add"}
  %broadcast.192 = f32[16]{0} broadcast(f32[] %add.8), dimensions={}
  %reduce.41 = f32[] reduce(f32[16]{0} %broadcast.192, f32[] %constant_72), dimensions={0}, to_apply=%Mean-reduction.1950, metadata={op_type="Mean" op_name="Mean"}
  %multiply.93 = f32[] multiply(f32[] %reduce.41, f32[] %constant_71), metadata={op_type="Mean" op_name="Mean"}
  %add.7 = f32[] add(f32[] %param_0, f32[] %multiply.93), metadata={op_type="AssignAddVariableOp" op_name="AssignAddVariableOp"}
  %param_4.703 = f32[] parameter(4)
  %add.600.clone.1 = f32[] add(f32[] %param_4.703, f32[] %select.114), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_2"}
  %param_5.452 = f32[] parameter(5)
  %add.228.clone.1 = f32[] add(f32[] %param_5.452, f32[] %multiply.519), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_6"}
  %param_6.798 = f32[] parameter(6)
  %param_7.834 = f32[] parameter(7)
  %constant_64_clone_1 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add_1"}
  %add.10.clone.1 = f32[] add(f32[] %param_3.1122, f32[] %constant_64_clone_1), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add_1"}
  %divide.0.clone.1 = f32[] divide(f32[] %param_7.834, f32[] %add.10.clone.1), metadata={op_type="RealDiv" op_name="model/bert_pretrain_loss_and_metric_layer/truediv"}
  %add.9.clone.1 = f32[] add(f32[] %param_6.798, f32[] %divide.0.clone.1), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp"}
  ROOT %tuple.142 = (f32[], f32[], f32[], f32[]) tuple(f32[] %add.7, f32[] %add.600.clone.1, f32[] %add.228.clone.1, f32[] %add.9.clone.1)
}

%model_bert_pretrain_loss_and_metric_layer_Sum_2-reduction.1986 (x.1987: f32[], y.1988: f32[]) -> f32[] {
  %x.1987 = f32[] parameter(0)
  %y.1988 = f32[] parameter(1)
  ROOT %add.1989 = f32[] add(f32[] %x.1987, f32[] %y.1988)
}

%model_bert_pretrain_loss_and_metric_layer_Sum_3-reduction.195 (x.196: f32[], y.197: f32[]) -> f32[] {
  %x.196 = f32[] parameter(0)
  %y.197 = f32[] parameter(1)
  ROOT %add.198 = f32[] add(f32[] %x.196, f32[] %y.197)
}

%model_bert_pretrain_loss_and_metric_layer_Sum-reduction.1932 (x.1933: f32[], y.1934: f32[]) -> f32[] {
  %x.1933 = f32[] parameter(0)
  %y.1934 = f32[] parameter(1)
  ROOT %add.1935 = f32[] add(f32[] %x.1933, f32[] %y.1934)
}

%fused_computation.2 (param_0.1071: s32[16,76], param_1.1477: s64[16,76], param_2.1394: f32[16,76], param_3.1279: f32[1216]) -> (f32[], f32[], f32[]) {
  %param_0.1071 = s32[16,76]{1,0} parameter(0)
  %param_1.1477 = s64[16,76]{1,0} parameter(1)
  %convert.25 = s32[16,76]{1,0} convert(s64[16,76]{1,0} %param_1.1477), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_7"}
  %compare.0 = pred[16,76]{1,0} compare(s32[16,76]{1,0} %param_0.1071, s32[16,76]{1,0} %convert.25), direction=EQ, metadata={op_type="Equal" op_name="model/bert_pretrain_loss_and_metric_layer/Equal"}
  %param_2.1394 = f32[16,76]{1,0} parameter(2)
  %convert.461 = s32[16,76]{1,0} convert(f32[16,76]{1,0} %param_2.1394), metadata={op_type="Cast" op_name="model/Cast"}
  %convert.460 = f32[16,76]{1,0} convert(s32[16,76]{1,0} %convert.461), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast"}
  %constant_73 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.193 = f32[16,76]{1,0} broadcast(f32[] %constant_73), dimensions={}
  %select.19 = f32[16,76]{1,0} select(pred[16,76]{1,0} %compare.0, f32[16,76]{1,0} %convert.460, f32[16,76]{1,0} %broadcast.193), metadata={op_type="Mul" op_name="model/bert_pretrain_loss_and_metric_layer/mul_1"}
  %bitcast.140 = f32[1216]{0} bitcast(f32[16,76]{1,0} %select.19)
  %reduce.42 = f32[] reduce(f32[1216]{0} %bitcast.140, f32[] %constant_73), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_2-reduction.1986, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_2"}
  %bitcast.238.clone.1 = f32[1216]{0} bitcast(f32[16,76]{1,0} %convert.460)
  %reduce.92.clone.1 = f32[] reduce(f32[1216]{0} %bitcast.238.clone.1, f32[] %constant_73), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_3-reduction.195, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %param_3.1279 = f32[1216]{0} parameter(3)
  %bitcast.143.clone.1 = f32[16,76]{1,0} bitcast(f32[1216]{0} %param_3.1279), metadata={op_type="Reshape" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/Reshape_2"}
  %multiply.94.clone.1 = f32[16,76]{1,0} multiply(f32[16,76]{1,0} %convert.460, f32[16,76]{1,0} %bitcast.143.clone.1), metadata={op_type="Mul" op_name="model/bert_pretrain_loss_and_metric_layer/mul"}
  %bitcast.142.clone.1 = f32[1216]{0} bitcast(f32[16,76]{1,0} %multiply.94.clone.1)
  %reduce.44.clone.1 = f32[] reduce(f32[1216]{0} %bitcast.142.clone.1, f32[] %constant_73), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum-reduction.1932, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum"}
  ROOT %tuple.144 = (f32[], f32[], f32[]) tuple(f32[] %reduce.42, f32[] %reduce.92.clone.1, f32[] %reduce.44.clone.1)
}

%min_S64.1974 (lhs.1975: s64[], rhs.1976: s64[]) -> s64[] {
  %lhs.1975 = s64[] parameter(0)
  %rhs.1976 = s64[] parameter(1)
  ROOT %minimum.1977 = s64[] minimum(s64[] %lhs.1975, s64[] %rhs.1976)
}

%fused_computation.3 (param_0.1224: f32[16,76], param_1.1667: f32[30522], param_2.1734: f16[1216,30528]) -> s64[16,76] {
  %param_2.1734 = f16[1216,30528]{1,0} parameter(2)
  %slice.45 = f16[1216,30522]{1,0} slice(f16[1216,30528]{1,0} %param_2.1734), slice={[0:1216], [0:30522]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/cls/predictions/MatMul"}
  %param_1.1667 = f32[30522]{0} parameter(1)
  %convert.819 = f16[30522]{0} convert(f32[30522]{0} %param_1.1667), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/BiasAdd/Cast"}
  %broadcast.2104 = f16[1216,30522]{1,0} broadcast(f16[30522]{0} %convert.819), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %add.605 = f16[1216,30522]{1,0} add(f16[1216,30522]{1,0} %slice.45, f16[1216,30522]{1,0} %broadcast.2104), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %convert.818 = f32[1216,30522]{1,0} convert(f16[1216,30522]{1,0} %add.605), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast_1"}
  %bitcast.456 = f32[16,76,30522]{2,1,0} bitcast(f32[1216,30522]{1,0} %convert.818), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_1"}
  %param_0.1224 = f32[16,76]{1,0} parameter(0)
  %broadcast.195 = f32[16,76,30522]{2,1,0} broadcast(f32[16,76]{1,0} %param_0.1224), dimensions={0,1}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %compare.1 = pred[16,76,30522]{2,1,0} compare(f32[16,76,30522]{2,1,0} %bitcast.456, f32[16,76,30522]{2,1,0} %broadcast.195), direction=EQ, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %iota.0 = s64[16,76,30522]{2,1,0} iota(), iota_dimension=2, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %constant_74 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %broadcast.194 = s64[16,76,30522]{2,1,0} broadcast(s64[] %constant_74), dimensions={}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %select.20 = s64[16,76,30522]{2,1,0} select(pred[16,76,30522]{2,1,0} %compare.1, s64[16,76,30522]{2,1,0} %iota.0, s64[16,76,30522]{2,1,0} %broadcast.194), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  ROOT %reduce.43 = s64[16,76]{1,0} reduce(s64[16,76,30522]{2,1,0} %select.20, s64[] %constant_74), dimensions={2}, to_apply=%min_S64.1974, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
}

%add_float_.1037 (x.1038: f32[], y.1039: f32[]) -> f32[] {
  %x.1038 = f32[] parameter(0)
  %y.1039 = f32[] parameter(1)
  ROOT %add.1040 = f32[] add(f32[] %x.1038, f32[] %y.1039)
}

%fused_computation.7 (param_0.1063: f32[1216], param_1.1474: s32[16,76], param_2.1391: f32[1216], param_3.830: f32[30522], param_4.524: f16[1216,30528]) -> f32[1216] {
  %param_1.1474 = s32[16,76]{1,0} parameter(1)
  %convert.416 = f32[16,76]{1,0} convert(s32[16,76]{1,0} %param_1.1474), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_2"}
  %convert.415 = s64[16,76]{1,0} convert(f32[16,76]{1,0} %convert.416), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_3"}
  %bitcast.310 = s64[1216]{0} bitcast(s64[16,76]{1,0} %convert.415), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_3"}
  %broadcast.1484 = s64[1216,30522]{1,0} broadcast(s64[1216]{0} %bitcast.310), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.10 = s64[1216,30522]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.74 = pred[1216,30522]{1,0} compare(s64[1216,30522]{1,0} %broadcast.1484, s64[1216,30522]{1,0} %iota.10), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_976 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1483 = f32[1216,30522]{1,0} broadcast(f32[] %constant_976), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_77 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.1482 = f32[1216,30522]{1,0} broadcast(f32[] %constant_77), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.78 = f32[1216,30522]{1,0} select(pred[1216,30522]{1,0} %compare.74, f32[1216,30522]{1,0} %broadcast.1483, f32[1216,30522]{1,0} %broadcast.1482), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_974 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1481 = s64[1216]{0} broadcast(s64[] %constant_974), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.73 = pred[1216]{0} compare(s64[1216]{0} %broadcast.1481, s64[1216]{0} %bitcast.310), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_973 = s64[] constant(30522), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1480 = s64[1216]{0} broadcast(s64[] %constant_973), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.72 = pred[1216]{0} compare(s64[1216]{0} %bitcast.310, s64[1216]{0} %broadcast.1480), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %and.7 = pred[1216]{0} and(pred[1216]{0} %compare.73, pred[1216]{0} %compare.72), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1478 = f32[1216]{0} broadcast(f32[] %constant_77), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_972 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1477 = f32[1216]{0} broadcast(f32[] %constant_972), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.77 = f32[1216]{0} select(pred[1216]{0} %and.7, f32[1216]{0} %broadcast.1478, f32[1216]{0} %broadcast.1477), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.1476 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %select.77), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %add.436 = f32[1216,30522]{1,0} add(f32[1216,30522]{1,0} %select.78, f32[1216,30522]{1,0} %broadcast.1476), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.0 = f32[1216,30522]{1,0} negate(f32[1216,30522]{1,0} %add.436), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_4.524 = f16[1216,30528]{1,0} parameter(4)
  %slice.33 = f16[1216,30522]{1,0} slice(f16[1216,30528]{1,0} %param_4.524), slice={[0:1216], [0:30522]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/cls/predictions/MatMul"}
  %param_3.830 = f32[30522]{0} parameter(3)
  %convert.440 = f16[30522]{0} convert(f32[30522]{0} %param_3.830), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/BiasAdd/Cast"}
  %broadcast.1559 = f16[1216,30522]{1,0} broadcast(f16[30522]{0} %convert.440), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %add.460 = f16[1216,30522]{1,0} add(f16[1216,30522]{1,0} %slice.33, f16[1216,30522]{1,0} %broadcast.1559), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %convert.439 = f32[1216,30522]{1,0} convert(f16[1216,30522]{1,0} %add.460), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast_1"}
  %param_2.1391 = f32[1216]{0} parameter(2)
  %broadcast.1558 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %param_2.1391), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.320 = f32[1216,30522]{1,0} subtract(f32[1216,30522]{1,0} %convert.439, f32[1216,30522]{1,0} %broadcast.1558), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.1063 = f32[1216]{0} parameter(0)
  %broadcast.196 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %param_0.1063), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.1 = f32[1216,30522]{1,0} subtract(f32[1216,30522]{1,0} %subtract.320, f32[1216,30522]{1,0} %broadcast.196), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.95 = f32[1216,30522]{1,0} multiply(f32[1216,30522]{1,0} %negate.0, f32[1216,30522]{1,0} %subtract.1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %reduce.45 = f32[1216]{0} reduce(f32[1216,30522]{1,0} %multiply.95, f32[] %constant_77), dimensions={1}, to_apply=%add_float_.1037, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
}

%model_bert_pretrain_loss_and_metric_layer_Sum_6-reduction.789 (x.790: f32[], y.791: f32[]) -> f32[] {
  %x.790 = f32[] parameter(0)
  %y.791 = f32[] parameter(1)
  ROOT %add.792 = f32[] add(f32[] %x.790, f32[] %y.791)
}

%fused_computation.8 (param_0.13: f32[], param_1.933: s32[16,1], param_2.679: s64[16]) -> f32[] {
  %param_0.13 = f32[] parameter(0)
  %param_2.679 = s64[16]{0} parameter(2)
  %convert.28 = s32[16]{0} convert(s64[16]{0} %param_2.679), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_11"}
  %param_1.933 = s32[16,1]{1,0} parameter(1)
  %bitcast.144 = s32[16]{0} bitcast(s32[16,1]{1,0} %param_1.933), metadata={op_type="Squeeze" op_name="model/bert_pretrain_loss_and_metric_layer/Squeeze"}
  %compare.2 = pred[16]{0} compare(s32[16]{0} %convert.28, s32[16]{0} %bitcast.144), direction=EQ, metadata={op_type="Equal" op_name="model/bert_pretrain_loss_and_metric_layer/Equal_1"}
  %convert.27 = f32[16]{0} convert(pred[16]{0} %compare.2), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_12"}
  %constant_78 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %reduce.46 = f32[] reduce(f32[16]{0} %convert.27, f32[] %constant_78), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_6-reduction.789, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_6"}
  ROOT %add.11 = f32[] add(f32[] %param_0.13, f32[] %reduce.46), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_4"}
}

%min_S64.778 (lhs.779: s64[], rhs.780: s64[]) -> s64[] {
  %lhs.779 = s64[] parameter(0)
  %rhs.780 = s64[] parameter(1)
  ROOT %minimum.781 = s64[] minimum(s64[] %lhs.779, s64[] %rhs.780)
}

%fused_computation.9 (param_0.1022: f32[16], param_1.1423: f32[2], param_2.1344: f16[16,8]) -> s64[16] {
  %param_2.1344 = f16[16,8]{1,0} parameter(2)
  %slice.17 = f16[16,2]{1,0} slice(f16[16,8]{1,0} %param_2.1344), slice={[0:16], [0:2]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/classification/predictions/transform/logits/MatMul"}
  %param_1.1423 = f32[2]{0} parameter(1)
  %convert.402 = f16[2]{0} convert(f32[2]{0} %param_1.1423), metadata={op_type="Cast" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd/Cast"}
  %broadcast.1447 = f16[16,2]{1,0} broadcast(f16[2]{0} %convert.402), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %add.423 = f16[16,2]{1,0} add(f16[16,2]{1,0} %slice.17, f16[16,2]{1,0} %broadcast.1447), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %convert.29 = f32[16,2]{1,0} convert(f16[16,2]{1,0} %add.423), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_4"}
  %param_0.1022 = f32[16]{0} parameter(0)
  %broadcast.342 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_0.1022), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.3 = pred[16,2]{1,0} compare(f32[16,2]{1,0} %convert.29, f32[16,2]{1,0} %broadcast.342), direction=EQ, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %iota.1 = s64[16,2]{1,0} iota(), iota_dimension=1, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %constant_79 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %broadcast.197 = s64[16,2]{1,0} broadcast(s64[] %constant_79), dimensions={}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %select.22 = s64[16,2]{1,0} select(pred[16,2]{1,0} %compare.3, s64[16,2]{1,0} %iota.1, s64[16,2]{1,0} %broadcast.197), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  ROOT %reduce.47 = s64[16]{0} reduce(s64[16,2]{1,0} %select.22, s64[] %constant_79), dimensions={1}, to_apply=%min_S64.778, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
}

%model_bert_pretrain_loss_and_metric_layer_Mean-reduction.898 (x.899: f32[], y.900: f32[]) -> f32[] {
  %x.899 = f32[] parameter(0)
  %y.900 = f32[] parameter(1)
  ROOT %add.901 = f32[] add(f32[] %x.899, f32[] %y.900)
}

%fused_computation.10 (param_0.1030: f32[16], param_1.1434: s32[16,1], param_2.1356: f32[16], param_3.805: f32[2], param_4.494: f16[16,8]) -> f32[] {
  %param_1.1434 = s32[16,1]{1,0} parameter(1)
  %convert.217 = f32[16,1]{1,0} convert(s32[16,1]{1,0} %param_1.1434), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_5"}
  %convert.216 = s64[16,1]{1,0} convert(f32[16,1]{1,0} %convert.217), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_6"}
  %bitcast.270 = s64[16]{0} bitcast(s64[16,1]{1,0} %convert.216), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_6"}
  %broadcast.802 = s64[16,2]{1,0} broadcast(s64[16]{0} %bitcast.270), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.6 = s64[16,2]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.34 = pred[16,2]{1,0} compare(s64[16,2]{1,0} %broadcast.802, s64[16,2]{1,0} %iota.6), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_510 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.800 = f32[16,2]{1,0} broadcast(f32[] %constant_510), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_81 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.797 = f32[16,2]{1,0} broadcast(f32[] %constant_81), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %select.50 = f32[16,2]{1,0} select(pred[16,2]{1,0} %compare.34, f32[16,2]{1,0} %broadcast.800, f32[16,2]{1,0} %broadcast.797), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_508 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.796 = s64[16]{0} broadcast(s64[] %constant_508), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.33 = pred[16]{0} compare(s64[16]{0} %broadcast.796, s64[16]{0} %bitcast.270), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_506 = s64[] constant(2), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.795 = s64[16]{0} broadcast(s64[] %constant_506), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.32 = pred[16]{0} compare(s64[16]{0} %bitcast.270, s64[16]{0} %broadcast.795), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %and.3 = pred[16]{0} and(pred[16]{0} %compare.33, pred[16]{0} %compare.32), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.794 = f32[16]{0} broadcast(f32[] %constant_81), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_505 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.793 = f32[16]{0} broadcast(f32[] %constant_505), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %select.49 = f32[16]{0} select(pred[16]{0} %and.3, f32[16]{0} %broadcast.794, f32[16]{0} %broadcast.793), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.792 = f32[16,2]{1,0} broadcast(f32[16]{0} %select.49), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %add.236 = f32[16,2]{1,0} add(f32[16,2]{1,0} %select.50, f32[16,2]{1,0} %broadcast.792), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.1 = f32[16,2]{1,0} negate(f32[16,2]{1,0} %add.236), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_4.494 = f16[16,8]{1,0} parameter(4)
  %slice.23 = f16[16,2]{1,0} slice(f16[16,8]{1,0} %param_4.494), slice={[0:16], [0:2]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/classification/predictions/transform/logits/MatMul"}
  %param_3.805 = f32[2]{0} parameter(3)
  %convert.412 = f16[2]{0} convert(f32[2]{0} %param_3.805), metadata={op_type="Cast" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd/Cast"}
  %broadcast.1458 = f16[16,2]{1,0} broadcast(f16[2]{0} %convert.412), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %add.430 = f16[16,2]{1,0} add(f16[16,2]{1,0} %slice.23, f16[16,2]{1,0} %broadcast.1458), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %convert.411 = f32[16,2]{1,0} convert(f16[16,2]{1,0} %add.430), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_4"}
  %param_2.1356 = f32[16]{0} parameter(2)
  %broadcast.1456 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_2.1356), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.311 = f32[16,2]{1,0} subtract(f32[16,2]{1,0} %convert.411, f32[16,2]{1,0} %broadcast.1456), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.1030 = f32[16]{0} parameter(0)
  %broadcast.198 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_0.1030), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.2 = f32[16,2]{1,0} subtract(f32[16,2]{1,0} %subtract.311, f32[16,2]{1,0} %broadcast.198), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.96 = f32[16,2]{1,0} multiply(f32[16,2]{1,0} %negate.1, f32[16,2]{1,0} %subtract.2), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %bitcast.145 = f32[32]{0} bitcast(f32[16,2]{1,0} %multiply.96)
  ROOT %reduce.48 = f32[] reduce(f32[32]{0} %bitcast.145, f32[] %constant_81), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Mean-reduction.898, metadata={op_type="Mean" op_name="model/bert_pretrain_loss_and_metric_layer/Mean"}
}

%fused_computation.15 (param_0.23: f32[768], param_1.1669: f32[], param_2.1738: f32[768], param_3.1126: f32[], param_4.711: f32[768], param_5.469: f32[768], param_6.447: f32[], param_7.771: f32[768], param_8.435: f32[768], param_9.282: f32[768], param_10.196: f32[768], param_11.237: f32[768], param_12.174: f32[768], param_13.45: f32[768], param_14.31: f32[768], param_15.63: f32[768], param_16.51: f32[768], param_17.19: f32[768], param_18.18: f32[768], param_19.52: f32[768], param_20.41: f32[768], param_21.14: f32[768], param_22.14: f32[768], param_23.55: f32[768], param_24.45: f32[768], param_25.15: f32[768], param_26.18: f32[768], param_27.48: f32[768], param_28.35: f32[768], param_29.4: f32[768], param_30.4: f32[768], param_31.15: f32[768], param_32.13: f32[768], param_33.4: f32[768], param_34.4: f32[768], param_35.13: f32[768], param_36.12: f32[768], param_37.3: f32[768]) -> (f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768], f32[768]) {
  %param_0.23 = f32[768]{0} parameter(0)
  %param_2.1738 = f32[768]{0} parameter(2)
  %param_4.711 = f32[768]{0} parameter(4)
  %convert.803.clone.1 = f16[768]{0} convert(f32[768]{0} %param_4.711), metadata={op_type="BiasAddGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/BiasAdd/BiasAddGrad"}
  %convert.802.clone.1 = f32[768]{0} convert(f16[768]{0} %convert.803.clone.1), metadata={op_type="Cast" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/BiasAdd/Cast/Cast"}
  %constant_1518_clone_1 = f32[] constant(0.0009765625), metadata={op_type="Mul" op_name="mul_1"}
  %broadcast.2091.clone.1 = f32[768]{0} broadcast(f32[] %constant_1518_clone_1), dimensions={}, metadata={op_type="Mul" op_name="mul_5"}
  %multiply.1389.clone.1 = f32[768]{0} multiply(f32[768]{0} %convert.802.clone.1, f32[768]{0} %broadcast.2091.clone.1), metadata={op_type="Mul" op_name="mul_44"}
  %subtract.8.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.1389.clone.1, f32[768]{0} %param_2.1738), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %constant_87_clone_1 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_3.1126 = f32[] parameter(3)
  %subtract.168.clone.1 = f32[] subtract(f32[] %constant_87_clone_1, f32[] %param_3.1126), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/update_0/ResourceApplyAdam"}
  %broadcast.350.clone.1 = f32[768]{0} broadcast(f32[] %subtract.168.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/update_0/ResourceApplyAdam"}
  %multiply.105.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.8.clone.1, f32[768]{0} %broadcast.350.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %add.17.clone.1 = f32[768]{0} add(f32[768]{0} %param_2.1738, f32[768]{0} %multiply.105.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %param_1.1669 = f32[] parameter(1)
  %broadcast.348 = f32[768]{0} broadcast(f32[] %param_1.1669), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/update_0/ResourceApplyAdam"}
  %multiply.102 = f32[768]{0} multiply(f32[768]{0} %add.17.clone.1, f32[768]{0} %broadcast.348), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %param_5.469 = f32[768]{0} parameter(5)
  %multiply.104.clone.1 = f32[768]{0} multiply(f32[768]{0} %multiply.1389.clone.1, f32[768]{0} %multiply.1389.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %subtract.7.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.104.clone.1, f32[768]{0} %param_5.469), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %param_6.447 = f32[] parameter(6)
  %subtract.169.clone.1 = f32[] subtract(f32[] %constant_87_clone_1, f32[] %param_6.447), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/update_0/ResourceApplyAdam"}
  %broadcast.351.clone.1 = f32[768]{0} broadcast(f32[] %subtract.169.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/update_0/ResourceApplyAdam"}
  %multiply.103.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.7.clone.1, f32[768]{0} %broadcast.351.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %add.16.clone.1 = f32[768]{0} add(f32[768]{0} %param_5.469, f32[768]{0} %multiply.103.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %sqrt.1 = f32[768]{0} sqrt(f32[768]{0} %add.16.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %constant_86 = f32[] constant(1e-06), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/update_0/ResourceApplyAdam"}
  %broadcast.349 = f32[768]{0} broadcast(f32[] %constant_86), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/update_0/ResourceApplyAdam"}
  %add.15 = f32[768]{0} add(f32[768]{0} %sqrt.1, f32[768]{0} %broadcast.349), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %divide.3 = f32[768]{0} divide(f32[768]{0} %multiply.102, f32[768]{0} %add.15), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %subtract.6 = f32[768]{0} subtract(f32[768]{0} %param_0.23, f32[768]{0} %divide.3), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_43/update_0/ResourceApplyAdam"}
  %param_7.771 = f32[768]{0} parameter(7)
  %param_10.196 = f32[768]{0} parameter(10)
  %param_9.282 = f32[768]{0} parameter(9)
  %multiply.521.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %param_9.282, f32[768]{0} %broadcast.2091.clone.1), metadata={op_type="Mul" op_name="mul_45"}
  %subtract.11.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.521.clone.1.clone.1, f32[768]{0} %param_10.196), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %multiply.110.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.11.clone.1.clone.1, f32[768]{0} %broadcast.350.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %add.20.clone.1.clone.1 = f32[768]{0} add(f32[768]{0} %param_10.196, f32[768]{0} %multiply.110.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %multiply.107.clone.1 = f32[768]{0} multiply(f32[768]{0} %add.20.clone.1.clone.1, f32[768]{0} %broadcast.348), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %param_8.435 = f32[768]{0} parameter(8)
  %multiply.109.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %multiply.521.clone.1.clone.1, f32[768]{0} %multiply.521.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %subtract.10.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.109.clone.1.clone.1, f32[768]{0} %param_8.435), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %multiply.108.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.10.clone.1.clone.1, f32[768]{0} %broadcast.351.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %add.19.clone.1.clone.1 = f32[768]{0} add(f32[768]{0} %param_8.435, f32[768]{0} %multiply.108.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %sqrt.2.clone.1 = f32[768]{0} sqrt(f32[768]{0} %add.19.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %add.18.clone.1 = f32[768]{0} add(f32[768]{0} %sqrt.2.clone.1, f32[768]{0} %broadcast.349), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %divide.4.clone.1 = f32[768]{0} divide(f32[768]{0} %multiply.107.clone.1, f32[768]{0} %add.18.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %subtract.9.clone.1 = f32[768]{0} subtract(f32[768]{0} %param_7.771, f32[768]{0} %divide.4.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_44/update_0/ResourceApplyAdam"}
  %param_11.237 = f32[768]{0} parameter(11)
  %param_14.31 = f32[768]{0} parameter(14)
  %param_13.45 = f32[768]{0} parameter(13)
  %multiply.524.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %param_13.45, f32[768]{0} %broadcast.2091.clone.1), metadata={op_type="Mul" op_name="mul_46"}
  %subtract.14.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.524.clone.1.clone.1, f32[768]{0} %param_14.31), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %multiply.115.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.14.clone.1.clone.1, f32[768]{0} %broadcast.350.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %add.23.clone.1.clone.1 = f32[768]{0} add(f32[768]{0} %param_14.31, f32[768]{0} %multiply.115.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %multiply.112.clone.1 = f32[768]{0} multiply(f32[768]{0} %add.23.clone.1.clone.1, f32[768]{0} %broadcast.348), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %param_12.174 = f32[768]{0} parameter(12)
  %multiply.114.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %multiply.524.clone.1.clone.1, f32[768]{0} %multiply.524.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %subtract.13.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.114.clone.1.clone.1, f32[768]{0} %param_12.174), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %multiply.113.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.13.clone.1.clone.1, f32[768]{0} %broadcast.351.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %add.22.clone.1.clone.1 = f32[768]{0} add(f32[768]{0} %param_12.174, f32[768]{0} %multiply.113.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %sqrt.3.clone.1 = f32[768]{0} sqrt(f32[768]{0} %add.22.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %add.21.clone.1 = f32[768]{0} add(f32[768]{0} %sqrt.3.clone.1, f32[768]{0} %broadcast.349), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %divide.5.clone.1 = f32[768]{0} divide(f32[768]{0} %multiply.112.clone.1, f32[768]{0} %add.21.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %subtract.12.clone.1 = f32[768]{0} subtract(f32[768]{0} %param_11.237, f32[768]{0} %divide.5.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_45/update_0/ResourceApplyAdam"}
  %param_15.63 = f32[768]{0} parameter(15)
  %param_18.18 = f32[768]{0} parameter(18)
  %param_17.19 = f32[768]{0} parameter(17)
  %multiply.526.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %param_17.19, f32[768]{0} %broadcast.2091.clone.1), metadata={op_type="Mul" op_name="mul_30"}
  %subtract.32.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.526.clone.1.clone.1, f32[768]{0} %param_18.18), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %multiply.144.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.32.clone.1.clone.1, f32[768]{0} %broadcast.350.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %add.41.clone.1.clone.1 = f32[768]{0} add(f32[768]{0} %param_18.18, f32[768]{0} %multiply.144.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %multiply.141.clone.1 = f32[768]{0} multiply(f32[768]{0} %add.41.clone.1.clone.1, f32[768]{0} %broadcast.348), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %param_16.51 = f32[768]{0} parameter(16)
  %multiply.143.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %multiply.526.clone.1.clone.1, f32[768]{0} %multiply.526.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %subtract.31.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.143.clone.1.clone.1, f32[768]{0} %param_16.51), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %multiply.142.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.31.clone.1.clone.1, f32[768]{0} %broadcast.351.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %add.40.clone.1.clone.1 = f32[768]{0} add(f32[768]{0} %param_16.51, f32[768]{0} %multiply.142.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %sqrt.9.clone.1 = f32[768]{0} sqrt(f32[768]{0} %add.40.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %add.39.clone.1 = f32[768]{0} add(f32[768]{0} %sqrt.9.clone.1, f32[768]{0} %broadcast.349), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %divide.11.clone.1 = f32[768]{0} divide(f32[768]{0} %multiply.141.clone.1, f32[768]{0} %add.39.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %subtract.30.clone.1 = f32[768]{0} subtract(f32[768]{0} %param_15.63, f32[768]{0} %divide.11.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_29/update_0/ResourceApplyAdam"}
  %param_19.52 = f32[768]{0} parameter(19)
  %param_22.14 = f32[768]{0} parameter(22)
  %param_21.14 = f32[768]{0} parameter(21)
  %multiply.528.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %param_21.14, f32[768]{0} %broadcast.2091.clone.1), metadata={op_type="Mul" op_name="mul_31"}
  %subtract.35.clone.1.clone.1 = f32[768]{0} subtract(f32[768]{0} %multiply.528.clone.1.clone.1, f32[768]{0} %param_22.14), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_30/update_0/ResourceApplyAdam"}
  %multiply.149.clone.1.clone.1 = f32[768]{0} multiply(f32[768]{0} %subtract.35.clone.1.clone.1, f32[768]{0} %broadcast.350.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_30/update_0/ResourceApplyAdam"}
