HloModule cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_44__XlaNumResourceArgs_584_.10505

%max_half_.3528 (x.3529: f16[], y.3530: f16[]) -> f16[] {
  %x.3529 = f16[] parameter(0)
  %y.3530 = f16[] parameter(1)
  ROOT %maximum.3531 = f16[] maximum(f16[] %x.3529, f16[] %y.3530)
}

%sparse_categorical_crossentropy_weighted_loss_Sum-reduction.3649 (x.3650: f32[], y.3651: f32[]) -> f32[] {
  %x.3650 = f32[] parameter(0)
  %y.3651 = f32[] parameter(1)
  ROOT %add.3652 = f32[] add(f32[] %x.3650, f32[] %y.3651)
}

%fused_computation (param_0: f32[], param_1.3568: f32[16]) -> f32[] {
  %param_0 = f32[] parameter(0)
  %param_1.3568 = f32[16]{0} parameter(1)
  %convert.128 = f16[16]{0} convert(f32[16]{0} %param_1.3568), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/Cast_1"}
  %convert.127 = f32[16]{0} convert(f16[16]{0} %convert.128), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/weighted_loss/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast"}
  %constant_1929 = f32[] constant(0), metadata={op_type="Mean" op_name="mobilenetv2_1.00_224/global_average_pooling2d/Mean"}
  %reduce.417 = f32[] reduce(f32[16]{0} %convert.127, f32[] %constant_1929), dimensions={0}, to_apply=%sparse_categorical_crossentropy_weighted_loss_Sum-reduction.3649, metadata={op_type="Sum" op_name="sparse_categorical_crossentropy/weighted_loss/Sum"}
  %constant_1927 = f32[] constant(0.0625)
  %multiply.1370 = f32[] multiply(f32[] %reduce.417, f32[] %constant_1927), metadata={op_type="DivNoNan" op_name="sparse_categorical_crossentropy/weighted_loss/value"}
  %convert.126 = f16[] convert(f32[] %multiply.1370), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/weighted_loss/Cast_1"}
  %convert.125 = f32[] convert(f16[] %convert.126), metadata={op_type="Cast" op_name="Cast"}
  %constant_1928 = f32[] constant(16), metadata={op_type="Cast" op_name="Cast_1"}
  %multiply.1369 = f32[] multiply(f32[] %convert.125, f32[] %constant_1928), metadata={op_type="Mul" op_name="Mul"}
  ROOT %add.899 = f32[] add(f32[] %param_0, f32[] %multiply.1369), metadata={op_type="AssignAddVariableOp" op_name="AssignAddVariableOp"}
}

%add_float_.3631 (x.3632: f32[], y.3633: f32[]) -> f32[] {
  %x.3632 = f32[] parameter(0)
  %y.3633 = f32[] parameter(1)
  ROOT %add.3634 = f32[] add(f32[] %x.3632, f32[] %y.3633)
}

%fused_computation.1 (param_0.3605: f32[16], param_1.5920: s32[16], param_2.5329: f32[16], param_3.3030: f16[16,1000]) -> f32[16] {
  %param_1.5920 = s32[16]{0} parameter(1)
  %convert.1242 = f16[16]{0} convert(s32[16]{0} %param_1.5920), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int32_Cast"}
  %convert.1241 = s64[16]{0} convert(f16[16]{0} %convert.1242), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_1"}
  %broadcast.6192 = s64[16,1000]{1,0} broadcast(s64[16]{0} %convert.1241), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.3 = s64[16,1000]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.80 = pred[16,1000]{1,0} compare(s64[16,1000]{1,0} %broadcast.6192, s64[16,1000]{1,0} %iota.3), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_5240 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.6191 = f32[16,1000]{1,0} broadcast(f32[] %constant_5240), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_1930 = f32[] constant(0), metadata={op_type="Mean" op_name="mobilenetv2_1.00_224/global_average_pooling2d/Mean"}
  %broadcast.6190 = f32[16,1000]{1,0} broadcast(f32[] %constant_1930), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.41 = f32[16,1000]{1,0} select(pred[16,1000]{1,0} %compare.80, f32[16,1000]{1,0} %broadcast.6191, f32[16,1000]{1,0} %broadcast.6190), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_5236 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.6188 = s64[16]{0} broadcast(s64[] %constant_5236), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.79 = pred[16]{0} compare(s64[16]{0} %broadcast.6188, s64[16]{0} %convert.1241), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_5235 = s64[] constant(1000), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.6187 = s64[16]{0} broadcast(s64[] %constant_5235), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.78 = pred[16]{0} compare(s64[16]{0} %convert.1241, s64[16]{0} %broadcast.6187), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %and.37 = pred[16]{0} and(pred[16]{0} %compare.79, pred[16]{0} %compare.78), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.6186 = f32[16]{0} broadcast(f32[] %constant_1930), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_5234 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.6185 = f32[16]{0} broadcast(f32[] %constant_5234), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.40 = f32[16]{0} select(pred[16]{0} %and.37, f32[16]{0} %broadcast.6186, f32[16]{0} %broadcast.6185), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.6184 = f32[16,1000]{1,0} broadcast(f32[16]{0} %select.40), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %add.1901 = f32[16,1000]{1,0} add(f32[16,1000]{1,0} %select.41, f32[16,1000]{1,0} %broadcast.6184), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.53 = f32[16,1000]{1,0} negate(f32[16,1000]{1,0} %add.1901), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_3.3030 = f16[16,1000]{1,0} parameter(3)
  %convert.1265 = f32[16,1000]{1,0} convert(f16[16,1000]{1,0} %param_3.3030), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/Cast"}
  %param_2.5329 = f32[16]{0} parameter(2)
  %broadcast.6257 = f32[16,1000]{1,0} broadcast(f32[16]{0} %param_2.5329), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.2041 = f32[16,1000]{1,0} subtract(f32[16,1000]{1,0} %convert.1265, f32[16,1000]{1,0} %broadcast.6257), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.3605 = f32[16]{0} parameter(0)
  %broadcast.2332 = f32[16,1000]{1,0} broadcast(f32[16]{0} %param_0.3605), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.260 = f32[16,1000]{1,0} subtract(f32[16,1000]{1,0} %subtract.2041, f32[16,1000]{1,0} %broadcast.2332), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.1371 = f32[16,1000]{1,0} multiply(f32[16,1000]{1,0} %negate.53, f32[16,1000]{1,0} %subtract.260), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %reduce.418 = f32[16]{0} reduce(f32[16,1000]{1,0} %multiply.1371, f32[] %constant_1930), dimensions={1}, to_apply=%add_float_.3631, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
}

%Sum_2-reduction.3575 (x.3576: f32[], y.3577: f32[]) -> f32[] {
  %x.3576 = f32[] parameter(0)
  %y.3577 = f32[] parameter(1)
  ROOT %add.3578 = f32[] add(f32[] %x.3576, f32[] %y.3577)
}

%fused_computation.2 (param_0.3: f32[], param_1.3570: s32[16], param_2.2629: s64[16]) -> f32[] {
  %param_0.3 = f32[] parameter(0)
  %param_2.2629 = s64[16]{0} parameter(2)
  %convert.131 = f32[16]{0} convert(s64[16]{0} %param_2.2629), metadata={op_type="Cast" op_name="Cast_5"}
  %param_1.3570 = s32[16]{0} parameter(1)
  %convert.130 = f32[16]{0} convert(s32[16]{0} %param_1.3570), metadata={op_type="Cast" op_name="Cast_3"}
  %compare.0 = pred[16]{0} compare(f32[16]{0} %convert.131, f32[16]{0} %convert.130), direction=EQ, metadata={op_type="Equal" op_name="Equal"}
  %convert.129 = f32[16]{0} convert(pred[16]{0} %compare.0), metadata={op_type="Cast" op_name="Cast_6"}
  %constant_1931 = f32[] constant(0), metadata={op_type="Mean" op_name="mobilenetv2_1.00_224/global_average_pooling2d/Mean"}
  %reduce.419 = f32[] reduce(f32[16]{0} %convert.129, f32[] %constant_1931), dimensions={0}, to_apply=%Sum_2-reduction.3575, metadata={op_type="Sum" op_name="Sum_2"}
  ROOT %add.900 = f32[] add(f32[] %param_0.3, f32[] %reduce.419), metadata={op_type="AssignAddVariableOp" op_name="AssignAddVariableOp_2"}
}

%min_S64.3559 (lhs.3560: s64[], rhs.3561: s64[]) -> s64[] {
  %lhs.3560 = s64[] parameter(0)
  %rhs.3561 = s64[] parameter(1)
  ROOT %minimum.3562 = s64[] minimum(s64[] %lhs.3560, s64[] %rhs.3561)
}

%fused_computation.3 (param_0.8: f32[16], param_1.7187: f16[16,1000], param_2.7011: f32[16]) -> s64[16] {
  %param_1.7187 = f16[16,1000]{1,0} parameter(1)
  %param_2.7011 = f32[16]{0} parameter(2)
  %convert.1924 = f16[16]{0} convert(f32[16]{0} %param_2.7011), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %broadcast.8658 = f16[16,1000]{1,0} broadcast(f16[16]{0} %convert.1924), dimensions={0}, metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %divide.790 = f16[16,1000]{1,0} divide(f16[16,1000]{1,0} %param_1.7187, f16[16,1000]{1,0} %broadcast.8658), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %convert.132 = f32[16,1000]{1,0} convert(f16[16,1000]{1,0} %divide.790), metadata={op_type="Cast" op_name="Cast_4"}
  %param_0.8 = f32[16]{0} parameter(0)
  %broadcast.2334 = f32[16,1000]{1,0} broadcast(f32[16]{0} %param_0.8), dimensions={0}, metadata={op_type="ArgMax" op_name="ArgMax"}
  %compare.1 = pred[16,1000]{1,0} compare(f32[16,1000]{1,0} %convert.132, f32[16,1000]{1,0} %broadcast.2334), direction=EQ, metadata={op_type="ArgMax" op_name="ArgMax"}
  %iota.0 = s64[16,1000]{1,0} iota(), iota_dimension=1, metadata={op_type="ArgMax" op_name="ArgMax"}
  %constant_1918 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="ArgMax"}
  %broadcast.2333 = s64[16,1000]{1,0} broadcast(s64[] %constant_1918), dimensions={}, metadata={op_type="ArgMax" op_name="ArgMax"}
  %select.0 = s64[16,1000]{1,0} select(pred[16,1000]{1,0} %compare.1, s64[16,1000]{1,0} %iota.0, s64[16,1000]{1,0} %broadcast.2333), metadata={op_type="ArgMax" op_name="ArgMax"}
  ROOT %reduce.420 = s64[16]{0} reduce(s64[16,1000]{1,0} %select.0, s64[] %constant_1918), dimensions={1}, to_apply=%min_S64.3559, metadata={op_type="ArgMax" op_name="ArgMax"}
}

%max_F32.3549 (lhs.3550: f32[], rhs.3551: f32[]) -> f32[] {
  %lhs.3550 = f32[] parameter(0)
  %rhs.3551 = f32[] parameter(1)
  ROOT %maximum.3552 = f32[] maximum(f32[] %lhs.3550, f32[] %rhs.3551)
}

%fused_computation.4 (param_0.4718: f16[16,1000], param_1.7185: f32[16]) -> f32[16] {
  %param_0.4718 = f16[16,1000]{1,0} parameter(0)
  %param_1.7185 = f32[16]{0} parameter(1)
  %convert.1922 = f16[16]{0} convert(f32[16]{0} %param_1.7185), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %broadcast.8656 = f16[16,1000]{1,0} broadcast(f16[16]{0} %convert.1922), dimensions={0}, metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %divide.788 = f16[16,1000]{1,0} divide(f16[16,1000]{1,0} %param_0.4718, f16[16,1000]{1,0} %broadcast.8656), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %convert.133 = f32[16,1000]{1,0} convert(f16[16,1000]{1,0} %divide.788), metadata={op_type="Cast" op_name="Cast_4"}
  %constant_1932 = f32[] constant(-inf), metadata={op_type="ArgMax" op_name="ArgMax"}
  ROOT %reduce.421 = f32[16]{0} reduce(f32[16,1000]{1,0} %convert.133, f32[] %constant_1932), dimensions={1}, to_apply=%max_F32.3549, metadata={op_type="ArgMax" op_name="ArgMax"}
}

%add_float_.3538 (x.3539: f32[], y.3540: f32[]) -> f32[] {
  %x.3539 = f32[] parameter(0)
  %y.3540 = f32[] parameter(1)
  ROOT %add.3541 = f32[] add(f32[] %x.3539, f32[] %y.3540)
}

%add_float_.3618 (x.3619: f32[], y.3620: f32[]) -> f32[] {
  %x.3619 = f32[] parameter(0)
  %y.3620 = f32[] parameter(1)
  ROOT %add.3621 = f32[] add(f32[] %x.3619, f32[] %y.3620)
}

%fused_computation.6 (param_0.4721: f16[16,1000], param_1.7189: f16[16], param_2.7419: f32[16]) -> (f32[16], f16[16,1000], f32[16], f32[16,1000]) {
  %param_0.4721 = f16[16,1000]{1,0} parameter(0)
  %param_1.7189 = f16[16]{0} parameter(1)
  %broadcast.2336.clone.1 = f16[16,1000]{1,0} broadcast(f16[16]{0} %param_1.7189), dimensions={0}, metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %subtract.261.clone.1 = f16[16,1000]{1,0} subtract(f16[16,1000]{1,0} %param_0.4721, f16[16,1000]{1,0} %broadcast.2336.clone.1), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %exponential.0.clone.1 = f16[16,1000]{1,0} exponential(f16[16,1000]{1,0} %subtract.261.clone.1), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %convert.135 = f32[16,1000]{1,0} convert(f16[16,1000]{1,0} %exponential.0.clone.1), metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %constant_1933 = f32[] constant(0), metadata={op_type="Mean" op_name="mobilenetv2_1.00_224/global_average_pooling2d/Mean"}
  %reduce.422 = f32[16]{0} reduce(f32[16,1000]{1,0} %convert.135, f32[] %constant_1933), dimensions={1}, to_apply=%add_float_.3538, metadata={op_type="Softmax" op_name="mobilenetv2_1.00_224/predictions/Softmax"}
  %convert.1262.clone.1.clone.1 = f32[16,1000]{1,0} convert(f16[16,1000]{1,0} %param_0.4721), metadata={op_type="Cast" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/Cast"}
  %param_2.7419 = f32[16]{0} parameter(2)
  %broadcast.6255.clone.1.clone.1 = f32[16,1000]{1,0} broadcast(f32[16]{0} %param_2.7419), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.2039.clone.1.clone.1 = f32[16,1000]{1,0} subtract(f32[16,1000]{1,0} %convert.1262.clone.1.clone.1, f32[16,1000]{1,0} %broadcast.6255.clone.1.clone.1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %exponential.1.clone.1.clone.1 = f32[16,1000]{1,0} exponential(f32[16,1000]{1,0} %subtract.2039.clone.1.clone.1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %reduce.634.clone.1 = f32[16]{0} reduce(f32[16,1000]{1,0} %exponential.1.clone.1.clone.1, f32[] %constant_1933), dimensions={1}, to_apply=%add_float_.3618, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %tuple.632 = (f32[16]{0}, f16[16,1000]{1,0}, f32[16]{0}, f32[16,1000]{1,0}) tuple(f32[16]{0} %reduce.422, f16[16,1000]{1,0} %exponential.0.clone.1, f32[16]{0} %reduce.634.clone.1, f32[16,1000]{1,0} %exponential.1.clone.1.clone.1)
}

%fused_computation.8 (param_0.16: f32[1280,1000], param_1.7190: f32[], param_2.7013: f32[1280,1000], param_3.3892: f32[], param_4.2996: f16[1280,1000], param_5.2827: f32[1280,1000], param_6.1605: f32[]) -> (f32[1280,1000], f32[1280,1000], f32[1280,1000]) {
  %param_0.16 = f32[1280,1000]{1,0} parameter(0)
  %param_2.7013 = f32[1280,1000]{1,0} parameter(2)
  %param_4.2996 = f16[1280,1000]{1,0} parameter(4)
  %convert.137.clone.1 = f32[1280,1000]{1,0} convert(f16[1280,1000]{1,0} %param_4.2996), metadata={op_type="Cast" op_name="gradient_tape/mobilenetv2_1.00_224/predictions/MatMul/Cast/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast"}
  %subtract.264.clone.1 = f32[1280,1000]{1,0} subtract(f32[1280,1000]{1,0} %convert.137.clone.1, f32[1280,1000]{1,0} %param_2.7013), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %constant_1935_clone_1 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_3.3892 = f32[] parameter(3)
  %subtract.948.clone.1 = f32[] subtract(f32[] %constant_1935_clone_1, f32[] %param_3.3892), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_153/ResourceApplyAdam"}
  %broadcast.2341.clone.1 = f32[1280,1000]{1,0} broadcast(f32[] %subtract.948.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %multiply.1375.clone.1 = f32[1280,1000]{1,0} multiply(f32[1280,1000]{1,0} %subtract.264.clone.1, f32[1280,1000]{1,0} %broadcast.2341.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %add.904.clone.1 = f32[1280,1000]{1,0} add(f32[1280,1000]{1,0} %param_2.7013, f32[1280,1000]{1,0} %multiply.1375.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %param_1.7190 = f32[] parameter(1)
  %broadcast.2339 = f32[1280,1000]{1,0} broadcast(f32[] %param_1.7190), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %multiply.1372 = f32[1280,1000]{1,0} multiply(f32[1280,1000]{1,0} %add.904.clone.1, f32[1280,1000]{1,0} %broadcast.2339), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %param_5.2827 = f32[1280,1000]{1,0} parameter(5)
  %multiply.1374.clone.1 = f32[1280,1000]{1,0} multiply(f32[1280,1000]{1,0} %convert.137.clone.1, f32[1280,1000]{1,0} %convert.137.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %subtract.263.clone.1 = f32[1280,1000]{1,0} subtract(f32[1280,1000]{1,0} %multiply.1374.clone.1, f32[1280,1000]{1,0} %param_5.2827), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %param_6.1605 = f32[] parameter(6)
  %subtract.949.clone.1 = f32[] subtract(f32[] %constant_1935_clone_1, f32[] %param_6.1605), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_153/ResourceApplyAdam"}
  %broadcast.2340.clone.1 = f32[1280,1000]{1,0} broadcast(f32[] %subtract.949.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %multiply.1373.clone.1 = f32[1280,1000]{1,0} multiply(f32[1280,1000]{1,0} %subtract.263.clone.1, f32[1280,1000]{1,0} %broadcast.2340.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %add.902.clone.1 = f32[1280,1000]{1,0} add(f32[1280,1000]{1,0} %param_5.2827, f32[1280,1000]{1,0} %multiply.1373.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %sqrt.0 = f32[1280,1000]{1,0} sqrt(f32[1280,1000]{1,0} %add.902.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %constant_1934 = f32[] constant(1e-07), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %broadcast.2337 = f32[1280,1000]{1,0} broadcast(f32[] %constant_1934), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %add.901 = f32[1280,1000]{1,0} add(f32[1280,1000]{1,0} %sqrt.0, f32[1280,1000]{1,0} %broadcast.2337), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %divide.211 = f32[1280,1000]{1,0} divide(f32[1280,1000]{1,0} %multiply.1372, f32[1280,1000]{1,0} %add.901), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  %subtract.262 = f32[1280,1000]{1,0} subtract(f32[1280,1000]{1,0} %param_0.16, f32[1280,1000]{1,0} %divide.211), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_156/ResourceApplyAdam"}
  ROOT %tuple.264 = (f32[1280,1000]{1,0}, f32[1280,1000]{1,0}, f32[1280,1000]{1,0}) tuple(f32[1280,1000]{1,0} %subtract.262, f32[1280,1000]{1,0} %add.904.clone.1, f32[1280,1000]{1,0} %add.902.clone.1)
}

%add_float_.3685 (x.3686: f32[], y.3687: f32[]) -> f32[] {
  %x.3686 = f32[] parameter(0)
  %y.3687 = f32[] parameter(1)
  ROOT %add.3688 = f32[] add(f32[] %x.3686, f32[] %y.3687)
}

%fused_computation.11 (param_0.19: f32[1000], param_1.7191: f32[], param_2.7015: f32[1000], param_3.3894: f32[], param_4.3001: f32[1000], param_5.2835: f32[], param_6.1612: f16[16,1000]) -> (f32[1000], f32[1000], f32[1000]) {
  %param_0.19 = f32[1000]{0} parameter(0)
  %param_2.7015 = f32[1000]{0} parameter(2)
  %param_6.1612 = f16[16,1000]{1,0} parameter(6)
  %convert.141.clone.1 = f32[16,1000]{1,0} convert(f16[16,1000]{1,0} %param_6.1612), metadata={op_type="BiasAddGrad" op_name="gradient_tape/mobilenetv2_1.00_224/predictions/BiasAdd/BiasAddGrad"}
  %constant_1941_clone_1 = f32[] constant(0), metadata={op_type="Mean" op_name="mobilenetv2_1.00_224/global_average_pooling2d/Mean"}
  %reduce.423.clone.1 = f32[1000]{0} reduce(f32[16,1000]{1,0} %convert.141.clone.1, f32[] %constant_1941_clone_1), dimensions={0}, to_apply=%add_float_.3685, metadata={op_type="BiasAddGrad" op_name="gradient_tape/mobilenetv2_1.00_224/predictions/BiasAdd/BiasAddGrad"}
  %convert.140.clone.1 = f16[1000]{0} convert(f32[1000]{0} %reduce.423.clone.1), metadata={op_type="BiasAddGrad" op_name="gradient_tape/mobilenetv2_1.00_224/predictions/BiasAdd/BiasAddGrad"}
  %convert.139.clone.1 = f32[1000]{0} convert(f16[1000]{0} %convert.140.clone.1), metadata={op_type="Cast" op_name="gradient_tape/mobilenetv2_1.00_224/predictions/BiasAdd/Cast/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast"}
  %subtract.267.clone.1 = f32[1000]{0} subtract(f32[1000]{0} %convert.139.clone.1, f32[1000]{0} %param_2.7015), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %constant_1939_clone_1 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_3.3894 = f32[] parameter(3)
  %subtract.950.clone.1 = f32[] subtract(f32[] %constant_1939_clone_1, f32[] %param_3.3894), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_153/ResourceApplyAdam"}
  %broadcast.2347.clone.1 = f32[1000]{0} broadcast(f32[] %subtract.950.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %multiply.1380.clone.1 = f32[1000]{0} multiply(f32[1000]{0} %subtract.267.clone.1, f32[1000]{0} %broadcast.2347.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %add.908.clone.1 = f32[1000]{0} add(f32[1000]{0} %param_2.7015, f32[1000]{0} %multiply.1380.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %param_1.7191 = f32[] parameter(1)
  %broadcast.2344 = f32[1000]{0} broadcast(f32[] %param_1.7191), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %multiply.1376 = f32[1000]{0} multiply(f32[1000]{0} %add.908.clone.1, f32[1000]{0} %broadcast.2344), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %param_4.3001 = f32[1000]{0} parameter(4)
  %multiply.1379.clone.1 = f32[1000]{0} multiply(f32[1000]{0} %convert.139.clone.1, f32[1000]{0} %convert.139.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %subtract.266.clone.1 = f32[1000]{0} subtract(f32[1000]{0} %multiply.1379.clone.1, f32[1000]{0} %param_4.3001), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %param_5.2835 = f32[] parameter(5)
  %subtract.951.clone.1 = f32[] subtract(f32[] %constant_1939_clone_1, f32[] %param_5.2835), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_153/ResourceApplyAdam"}
  %broadcast.2346.clone.1 = f32[1000]{0} broadcast(f32[] %subtract.951.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %multiply.1378.clone.1 = f32[1000]{0} multiply(f32[1000]{0} %subtract.266.clone.1, f32[1000]{0} %broadcast.2346.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %add.906.clone.1 = f32[1000]{0} add(f32[1000]{0} %param_4.3001, f32[1000]{0} %multiply.1378.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %sqrt.1 = f32[1000]{0} sqrt(f32[1000]{0} %add.906.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %constant_1937 = f32[] constant(1e-07), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %broadcast.2342 = f32[1000]{0} broadcast(f32[] %constant_1937), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %add.905 = f32[1000]{0} add(f32[1000]{0} %sqrt.1, f32[1000]{0} %broadcast.2342), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %divide.212 = f32[1000]{0} divide(f32[1000]{0} %multiply.1376, f32[1000]{0} %add.905), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %subtract.265 = f32[1000]{0} subtract(f32[1000]{0} %param_0.19, f32[1000]{0} %divide.212), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  ROOT %tuple.266 = (f32[1000]{0}, f32[1000]{0}, f32[1000]{0}) tuple(f32[1000]{0} %subtract.265, f32[1000]{0} %add.908.clone.1, f32[1000]{0} %add.906.clone.1)
}

%fused_computation.18 (param_0.28: f32[16], param_1.7193: f32[], param_2.7019: f32[16], param_3.3898: f32[], param_4.3009: f32[16], param_5.2848: f32[16], param_6.1622: f32[16], param_7.1266: f32[16], param_8.737: f32[], param_9.1275: f32[16], param_10.672: f32[16], param_11.521: f32[16], param_12.255: f32[16], param_13.498: f32[16], param_14.455: f32[16]) -> (f32[16], f32[16], f32[16], f32[16], f32[16], f32[16], f32[16], f32[16]) {
  %param_0.28 = f32[16]{0} parameter(0)
  %param_2.7019 = f32[16]{0} parameter(2)
  %param_4.3009 = f32[16]{0} parameter(4)
  %constant_1948_clone_1 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.8598.clone.1 = f32[16]{0} broadcast(f32[] %constant_1948_clone_1), dimensions={}, metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormGradV3"}
  %param_6.1622 = f32[16]{0} parameter(6)
  %constant_7854_clone_1 = f32[] constant(4.98246163e-06)
  %broadcast.8597.clone.1 = f32[16]{0} broadcast(f32[] %constant_7854_clone_1), dimensions={}
  %multiply.7566.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_6.1622, f32[16]{0} %broadcast.8597.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %param_5.2848 = f32[16]{0} parameter(5)
  %multiply.7565.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_5.2848, f32[16]{0} %broadcast.8597.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %multiply.7563.clone.1 = f32[16]{0} multiply(f32[16]{0} %multiply.7565.clone.1, f32[16]{0} %multiply.7565.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %subtract.3191.clone.1 = f32[16]{0} subtract(f32[16]{0} %multiply.7566.clone.1, f32[16]{0} %multiply.7563.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %constant_7853_clone_1 = f32[] constant(0.001), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %broadcast.8595.clone.1 = f32[16]{0} broadcast(f32[] %constant_7853_clone_1), dimensions={}
  %add.2718.clone.1 = f32[16]{0} add(f32[16]{0} %subtract.3191.clone.1, f32[16]{0} %broadcast.8595.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %rsqrt.1044.clone.1 = f32[16]{0} rsqrt(f32[16]{0} %add.2718.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %multiply.7562.clone.1 = f32[16]{0} multiply(f32[16]{0} %rsqrt.1044.clone.1, f32[16]{0} %rsqrt.1044.clone.1), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormGradV3"}
  %divide.786.clone.1 = f32[16]{0} divide(f32[16]{0} %broadcast.8598.clone.1, f32[16]{0} %multiply.7562.clone.1), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormGradV3"}
  %rsqrt.312.clone.1 = f32[16]{0} rsqrt(f32[16]{0} %divide.786.clone.1), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormGradV3"}
  %multiply.2992.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_4.3009, f32[16]{0} %rsqrt.312.clone.1), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormGradV3"}
  %subtract.273.clone.1 = f32[16]{0} subtract(f32[16]{0} %multiply.2992.clone.1, f32[16]{0} %param_2.7019), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %param_3.3898 = f32[] parameter(3)
  %subtract.954.clone.1 = f32[] subtract(f32[] %constant_1948_clone_1, f32[] %param_3.3898), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_153/ResourceApplyAdam"}
  %broadcast.3056.clone.1 = f32[16]{0} broadcast(f32[] %subtract.954.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %multiply.1392.clone.1 = f32[16]{0} multiply(f32[16]{0} %subtract.273.clone.1, f32[16]{0} %broadcast.3056.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %add.914.clone.1 = f32[16]{0} add(f32[16]{0} %param_2.7019, f32[16]{0} %multiply.1392.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %param_1.7193 = f32[] parameter(1)
  %broadcast.3054 = f32[16]{0} broadcast(f32[] %param_1.7193), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %multiply.1388 = f32[16]{0} multiply(f32[16]{0} %add.914.clone.1, f32[16]{0} %broadcast.3054), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %param_7.1266 = f32[16]{0} parameter(7)
  %multiply.1391.clone.1 = f32[16]{0} multiply(f32[16]{0} %multiply.2992.clone.1, f32[16]{0} %multiply.2992.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %subtract.272.clone.1 = f32[16]{0} subtract(f32[16]{0} %multiply.1391.clone.1, f32[16]{0} %param_7.1266), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %param_8.737 = f32[] parameter(8)
  %subtract.955.clone.1 = f32[] subtract(f32[] %constant_1948_clone_1, f32[] %param_8.737), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_153/ResourceApplyAdam"}
  %broadcast.3057.clone.1 = f32[16]{0} broadcast(f32[] %subtract.955.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %multiply.1390.clone.1 = f32[16]{0} multiply(f32[16]{0} %subtract.272.clone.1, f32[16]{0} %broadcast.3057.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %add.913.clone.1 = f32[16]{0} add(f32[16]{0} %param_7.1266, f32[16]{0} %multiply.1390.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %sqrt.3 = f32[16]{0} sqrt(f32[16]{0} %add.913.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %constant_1947 = f32[] constant(1e-07), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_157/ResourceApplyAdam"}
  %broadcast.3055 = f32[16]{0} broadcast(f32[] %constant_1947), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %add.912 = f32[16]{0} add(f32[16]{0} %sqrt.3, f32[16]{0} %broadcast.3055), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %divide.214 = f32[16]{0} divide(f32[16]{0} %multiply.1388, f32[16]{0} %add.912), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %subtract.271 = f32[16]{0} subtract(f32[16]{0} %param_0.28, f32[16]{0} %divide.214), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %param_9.1275 = f32[16]{0} parameter(9)
  %param_12.255 = f32[16]{0} parameter(12)
  %param_11.521 = f32[16]{0} parameter(11)
  %subtract.270.clone.1.clone.1 = f32[16]{0} subtract(f32[16]{0} %param_11.521, f32[16]{0} %param_12.255), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %multiply.1386.clone.1.clone.1 = f32[16]{0} multiply(f32[16]{0} %subtract.270.clone.1.clone.1, f32[16]{0} %broadcast.3056.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %add.911.clone.1.clone.1 = f32[16]{0} add(f32[16]{0} %param_12.255, f32[16]{0} %multiply.1386.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %multiply.1381.clone.1 = f32[16]{0} multiply(f32[16]{0} %add.911.clone.1.clone.1, f32[16]{0} %broadcast.3054), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %param_10.672 = f32[16]{0} parameter(10)
  %multiply.1385.clone.1.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_11.521, f32[16]{0} %param_11.521), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %subtract.269.clone.1.clone.1 = f32[16]{0} subtract(f32[16]{0} %multiply.1385.clone.1.clone.1, f32[16]{0} %param_10.672), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %multiply.1383.clone.1.clone.1 = f32[16]{0} multiply(f32[16]{0} %subtract.269.clone.1.clone.1, f32[16]{0} %broadcast.3057.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %add.910.clone.1.clone.1 = f32[16]{0} add(f32[16]{0} %param_10.672, f32[16]{0} %multiply.1383.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %sqrt.2.clone.1 = f32[16]{0} sqrt(f32[16]{0} %add.910.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %add.909.clone.1 = f32[16]{0} add(f32[16]{0} %sqrt.2.clone.1, f32[16]{0} %broadcast.3055), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %divide.213.clone.1 = f32[16]{0} divide(f32[16]{0} %multiply.1381.clone.1, f32[16]{0} %add.909.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %subtract.268.clone.1 = f32[16]{0} subtract(f32[16]{0} %param_9.1275, f32[16]{0} %divide.213.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_8/ResourceApplyAdam"}
  %param_13.498 = f32[16]{0} parameter(13)
  %constant_3637_clone_1 = f32[] constant(0.999), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %broadcast.4484.clone.1 = f32[16]{0} broadcast(f32[] %constant_3637_clone_1), dimensions={}, metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %multiply.2965.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_13.498, f32[16]{0} %broadcast.4484.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %constant_3636_clone_1 = f32[] constant(0.00100000505)
  %broadcast.3035.clone.1 = f32[16]{0} broadcast(f32[] %constant_3636_clone_1), dimensions={}
  %multiply.2964.clone.1 = f32[16]{0} multiply(f32[16]{0} %subtract.3191.clone.1, f32[16]{0} %broadcast.3035.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %add.1629.clone.1 = f32[16]{0} add(f32[16]{0} %multiply.2965.clone.1, f32[16]{0} %multiply.2964.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %param_14.455 = f32[16]{0} parameter(14)
  %multiply.2970.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_14.455, f32[16]{0} %broadcast.4484.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %constant_3641_clone_1 = f32[] constant(4.982462e-09)
  %broadcast.3036.clone.1 = f32[16]{0} broadcast(f32[] %constant_3641_clone_1), dimensions={}
  %multiply.2969.clone.1 = f32[16]{0} multiply(f32[16]{0} %param_5.2848, f32[16]{0} %broadcast.3036.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  %add.1630.clone.1 = f32[16]{0} add(f32[16]{0} %multiply.2970.clone.1, f32[16]{0} %multiply.2969.clone.1), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3"}
  ROOT %tuple.856 = (f32[16]{0}, f32[16]{0}, f32[16]{0}, f32[16]{0}, f32[16]{0}, f32[16]{0}, f32[16]{0}, f32[16]{0}) tuple(f32[16]{0} %subtract.271, f32[16]{0} %add.914.clone.1, f32[16]{0} %add.913.clone.1, f32[16]{0} %subtract.268.clone.1, f32[16]{0} %add.911.clone.1.clone.1, f32[16]{0} %add.910.clone.1.clone.1, f32[16]{0} %add.1629.clone.1, f32[16]{0} %add.1630.clone.1)
}

%fused_computation.43 (param_0.4654: f32[32], param_1.7111: f32[32], param_2.6935: f32[32], param_3.3871: f32[32], param_4.2972: f16[16,112,112,32], param_5.2785: f32[32], param_6.1586: f16[16,112,112,32], param_7.1223: f16[16,112,112,32]) -> f16[16,112,112,32] {
  %param_2.6935 = f32[32]{0} parameter(2)
  %constant_7791 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.8542 = f32[32]{0} broadcast(f32[] %constant_7791), dimensions={}, metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/block_3_project_BN/FusedBatchNormGradV3"}
  %param_5.2785 = f32[32]{0} parameter(5)
  %constant_1981 = f32[] constant(4.98246163e-06)
  %broadcast.8541 = f32[32]{0} broadcast(f32[] %constant_1981), dimensions={}
  %multiply.7491 = f32[32]{0} multiply(f32[32]{0} %param_5.2785, f32[32]{0} %broadcast.8541), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %param_3.3871 = f32[32]{0} parameter(3)
  %multiply.7490 = f32[32]{0} multiply(f32[32]{0} %param_3.3871, f32[32]{0} %broadcast.8541), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %multiply.7489 = f32[32]{0} multiply(f32[32]{0} %multiply.7490, f32[32]{0} %multiply.7490), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %subtract.3175 = f32[32]{0} subtract(f32[32]{0} %multiply.7491, f32[32]{0} %multiply.7489), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %constant_7789 = f32[] constant(0.001), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %broadcast.8540 = f32[32]{0} broadcast(f32[] %constant_7789), dimensions={}
  %add.2702 = f32[32]{0} add(f32[32]{0} %subtract.3175, f32[32]{0} %broadcast.8540), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %rsqrt.1028 = f32[32]{0} rsqrt(f32[32]{0} %add.2702), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %multiply.7488 = f32[32]{0} multiply(f32[32]{0} %rsqrt.1028, f32[32]{0} %rsqrt.1028), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %divide.770 = f32[32]{0} divide(f32[32]{0} %broadcast.8542, f32[32]{0} %multiply.7488), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %rsqrt.318 = f32[32]{0} rsqrt(f32[32]{0} %divide.770), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %multiply.1425 = f32[32]{0} multiply(f32[32]{0} %param_2.6935, f32[32]{0} %rsqrt.318), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %multiply.1424 = f32[32]{0} multiply(f32[32]{0} %multiply.1425, f32[32]{0} %broadcast.8541), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %broadcast.2370 = f32[16,112,112,32]{3,2,1,0} broadcast(f32[32]{0} %multiply.1424), dimensions={3}
  %param_7.1223 = f16[16,112,112,32]{3,2,1,0} parameter(7)
  %constant_7882 = f16[] constant(6), metadata={op_type="Relu6" op_name="mobilenetv2_1.00_224/Conv1_relu/Relu6"}
  %broadcast.8621 = f16[16,112,112,32]{3,2,1,0} broadcast(f16[] %constant_7882), dimensions={}, metadata={op_type="Relu6" op_name="mobilenetv2_1.00_224/Conv1_relu/Relu6"}
  %compare.502 = pred[16,112,112,32]{3,2,1,0} compare(f16[16,112,112,32]{3,2,1,0} %param_7.1223, f16[16,112,112,32]{3,2,1,0} %broadcast.8621), direction=LT, metadata={op_type="Relu6Grad" op_name="gradient_tape/mobilenetv2_1.00_224/Conv1_relu/Relu6/Relu6Grad"}
  %constant_7881 = f16[] constant(0), metadata={op_type="Relu6" op_name="mobilenetv2_1.00_224/Conv1_relu/Relu6"}
  %broadcast.8620 = f16[16,112,112,32]{3,2,1,0} broadcast(f16[] %constant_7881), dimensions={}, metadata={op_type="Relu6" op_name="mobilenetv2_1.00_224/Conv1_relu/Relu6"}
  %compare.501 = pred[16,112,112,32]{3,2,1,0} compare(f16[16,112,112,32]{3,2,1,0} %param_7.1223, f16[16,112,112,32]{3,2,1,0} %broadcast.8620), direction=GT, metadata={op_type="Relu6Grad" op_name="gradient_tape/mobilenetv2_1.00_224/Conv1_relu/Relu6/Relu6Grad"}
  %and.247 = pred[16,112,112,32]{3,2,1,0} and(pred[16,112,112,32]{3,2,1,0} %compare.502, pred[16,112,112,32]{3,2,1,0} %compare.501), metadata={op_type="Relu6Grad" op_name="gradient_tape/mobilenetv2_1.00_224/Conv1_relu/Relu6/Relu6Grad"}
  %param_6.1586 = f16[16,112,112,32]{3,2,1,0} parameter(6)
  %select.253 = f16[16,112,112,32]{3,2,1,0} select(pred[16,112,112,32]{3,2,1,0} %and.247, f16[16,112,112,32]{3,2,1,0} %param_6.1586, f16[16,112,112,32]{3,2,1,0} %broadcast.8620), metadata={op_type="Relu6Grad" op_name="gradient_tape/mobilenetv2_1.00_224/Conv1_relu/Relu6/Relu6Grad"}
  %convert.148 = f32[16,112,112,32]{3,2,1,0} convert(f16[16,112,112,32]{3,2,1,0} %select.253), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %constant_1980 = f32[] constant(200704), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/block_1_expand_BN/FusedBatchNormGradV3"}
  %broadcast.3081 = f32[16,112,112,32]{3,2,1,0} broadcast(f32[] %constant_1980), dimensions={}, metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/expanded_conv_depthwise_BN/FusedBatchNormGradV3"}
  %multiply.1423 = f32[16,112,112,32]{3,2,1,0} multiply(f32[16,112,112,32]{3,2,1,0} %convert.148, f32[16,112,112,32]{3,2,1,0} %broadcast.3081), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %param_1.7111 = f32[32]{0} parameter(1)
  %broadcast.2369 = f32[16,112,112,32]{3,2,1,0} broadcast(f32[32]{0} %param_1.7111), dimensions={3}, metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %subtract.296 = f32[16,112,112,32]{3,2,1,0} subtract(f32[16,112,112,32]{3,2,1,0} %multiply.1423, f32[16,112,112,32]{3,2,1,0} %broadcast.2369), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %param_0.4654 = f32[32]{0} parameter(0)
  %broadcast.2367 = f32[16,112,112,32]{3,2,1,0} broadcast(f32[32]{0} %param_0.4654), dimensions={3}, metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %param_4.2972 = f16[16,112,112,32]{3,2,1,0} parameter(4)
  %convert.834 = f32[16,112,112,32]{3,2,1,0} convert(f16[16,112,112,32]{3,2,1,0} %param_4.2972), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %broadcast.4527 = f32[16,112,112,32]{3,2,1,0} broadcast(f32[32]{0} %multiply.7490), dimensions={3}, metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %subtract.1273 = f32[16,112,112,32]{3,2,1,0} subtract(f32[16,112,112,32]{3,2,1,0} %convert.834, f32[16,112,112,32]{3,2,1,0} %broadcast.4527), metadata={op_type="FusedBatchNormV3" op_name="mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormV3"}
  %multiply.1422 = f32[16,112,112,32]{3,2,1,0} multiply(f32[16,112,112,32]{3,2,1,0} %broadcast.2367, f32[16,112,112,32]{3,2,1,0} %subtract.1273), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %broadcast.2366 = f32[16,112,112,32]{3,2,1,0} broadcast(f32[32]{0} %divide.770), dimensions={3}
  %divide.222 = f32[16,112,112,32]{3,2,1,0} divide(f32[16,112,112,32]{3,2,1,0} %multiply.1422, f32[16,112,112,32]{3,2,1,0} %broadcast.2366), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %subtract.295 = f32[16,112,112,32]{3,2,1,0} subtract(f32[16,112,112,32]{3,2,1,0} %subtract.296, f32[16,112,112,32]{3,2,1,0} %divide.222), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
  %multiply.1421 = f32[16,112,112,32]{3,2,1,0} multiply(f32[16,112,112,32]{3,2,1,0} %broadcast.2370, f32[16,112,112,32]{3,2,1,0} %subtract.295), metadata={op_type="FusedBatchNormGradV3" op_name="gradient_tape/mobilenetv2_1.00_224/bn_Conv1/FusedBatchNormGradV3"}
