HloModule cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_123__XlaNumResourceArgs_156_.2342

%max_half_.413 (x.414: f16[], y.415: f16[]) -> f16[] {
  %x.414 = f16[] parameter(0)
  %y.415 = f16[] parameter(1)
  ROOT %maximum.416 = f16[] maximum(f16[] %x.414, f16[] %y.415)
}

%add_float_.423 (x.424: f32[], y.425: f32[]) -> f32[] {
  %x.424 = f32[] parameter(0)
  %y.425 = f32[] parameter(1)
  ROOT %add.426 = f32[] add(f32[] %x.424, f32[] %y.425)
}

%max_half_.557 (x.558: f16[], y.559: f16[]) -> f16[] {
  %x.558 = f16[] parameter(0)
  %y.559 = f16[] parameter(1)
  ROOT %maximum.560 = f16[] maximum(f16[] %x.558, f16[] %y.559)
}

%add_float_.567 (x.568: f32[], y.569: f32[]) -> f32[] {
  %x.568 = f32[] parameter(0)
  %y.569 = f32[] parameter(1)
  ROOT %add.570 = f32[] add(f32[] %x.568, f32[] %y.569)
}

%gradient_tape_model_bert_pretrainer_bert_encoder_1_transformer_layer_1_self_attention_softmax_Sum-reduction.1306 (x.1307: f32[], y.1308: f32[]) -> f32[] {
  %x.1307 = f32[] parameter(0)
  %y.1308 = f32[] parameter(1)
  ROOT %add.1309 = f32[] add(f32[] %x.1307, f32[] %y.1308)
}

%gradient_tape_model_bert_pretrainer_bert_encoder_1_transformer_layer_0_self_attention_softmax_Sum-reduction.1566 (x.1567: f32[], y.1568: f32[]) -> f32[] {
  %x.1567 = f32[] parameter(0)
  %y.1568 = f32[] parameter(1)
  ROOT %add.1569 = f32[] add(f32[] %x.1567, f32[] %y.1568)
}

%Mean-reduction.1836 (x.1837: f32[], y.1838: f32[]) -> f32[] {
  %x.1837 = f32[] parameter(0)
  %y.1838 = f32[] parameter(1)
  ROOT %add.1839 = f32[] add(f32[] %x.1837, f32[] %y.1838)
}

%fused_computation (param_0: f32[], param_1.581: f32[], param_2.416: f32[], param_3.315: f32[], param_4.223: f32[], param_5.141: f32[], param_6.96: f32[], param_7.60: f32[]) -> (f32[], f32[], f32[], f32[]) {
  %param_0 = f32[] parameter(0)
  %param_1.581 = f32[] parameter(1)
  %constant_97 = f32[] constant(0.0625), metadata={op_type="Const" op_name="gradient_tape/model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/ExpandDims"}
  %multiply.133 = f32[] multiply(f32[] %param_1.581, f32[] %constant_97), metadata={op_type="Mean" op_name="model/bert_pretrain_loss_and_metric_layer/Mean"}
  %param_3.315 = f32[] parameter(3)
  %constant_98 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %compare.83 = pred[] compare(f32[] %param_3.315, f32[] %constant_98), direction=EQ, metadata={op_type="DivNoNan" op_name="gradient_tape/model/bert_pretrain_loss_and_metric_layer/div_no_nan/div_no_nan"}
  %param_2.416 = f32[] parameter(2)
  %divide.30 = f32[] divide(f32[] %param_2.416, f32[] %param_3.315), metadata={op_type="DivNoNan" op_name="model/bert_pretrain_loss_and_metric_layer/div_no_nan"}
  %select.78 = f32[] select(pred[] %compare.83, f32[] %constant_98, f32[] %divide.30), metadata={op_type="DivNoNan" op_name="model/bert_pretrain_loss_and_metric_layer/div_no_nan"}
  %add.38 = f32[] add(f32[] %multiply.133, f32[] %select.78), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add"}
  %broadcast.109 = f32[16]{0} broadcast(f32[] %add.38), dimensions={}
  %reduce.33 = f32[] reduce(f32[16]{0} %broadcast.109, f32[] %constant_98), dimensions={0}, to_apply=%Mean-reduction.1836, metadata={op_type="Mean" op_name="Mean"}
  %multiply.36 = f32[] multiply(f32[] %reduce.33, f32[] %constant_97), metadata={op_type="Mean" op_name="Mean"}
  %add.37 = f32[] add(f32[] %param_0, f32[] %multiply.36), metadata={op_type="AssignAddVariableOp" op_name="AssignAddVariableOp"}
  %param_4.223 = f32[] parameter(4)
  %add.179.clone.1 = f32[] add(f32[] %param_4.223, f32[] %select.78), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_2"}
  %param_5.141 = f32[] parameter(5)
  %add.92.clone.1 = f32[] add(f32[] %param_5.141, f32[] %multiply.133), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_6"}
  %param_6.96 = f32[] parameter(6)
  %param_7.60 = f32[] parameter(7)
  %constant_89_clone_1 = f32[] constant(1e-05), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add_1"}
  %add.40.clone.1 = f32[] add(f32[] %param_3.315, f32[] %constant_89_clone_1), metadata={op_type="AddV2" op_name="model/bert_pretrain_loss_and_metric_layer/add_1"}
  %divide.0.clone.1 = f32[] divide(f32[] %param_7.60, f32[] %add.40.clone.1), metadata={op_type="RealDiv" op_name="model/bert_pretrain_loss_and_metric_layer/truediv"}
  %add.39.clone.1 = f32[] add(f32[] %param_6.96, f32[] %divide.0.clone.1), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp"}
  ROOT %tuple.16 = (f32[], f32[], f32[], f32[]) tuple(f32[] %add.37, f32[] %add.179.clone.1, f32[] %add.92.clone.1, f32[] %add.39.clone.1)
}

%model_bert_pretrain_loss_and_metric_layer_Sum_2-reduction.1872 (x.1873: f32[], y.1874: f32[]) -> f32[] {
  %x.1873 = f32[] parameter(0)
  %y.1874 = f32[] parameter(1)
  ROOT %add.1875 = f32[] add(f32[] %x.1873, f32[] %y.1874)
}

%model_bert_pretrain_loss_and_metric_layer_Sum_3-reduction.210 (x.211: f32[], y.212: f32[]) -> f32[] {
  %x.211 = f32[] parameter(0)
  %y.212 = f32[] parameter(1)
  ROOT %add.213 = f32[] add(f32[] %x.211, f32[] %y.212)
}

%model_bert_pretrain_loss_and_metric_layer_Sum-reduction.1818 (x.1819: f32[], y.1820: f32[]) -> f32[] {
  %x.1819 = f32[] parameter(0)
  %y.1820 = f32[] parameter(1)
  ROOT %add.1821 = f32[] add(f32[] %x.1819, f32[] %y.1820)
}

%fused_computation.2 (param_0.605: s32[16,76], param_1.524: s64[16,76], param_2.376: f32[16,76], param_3.336: f32[1216]) -> (f32[], f32[], f32[]) {
  %param_0.605 = s32[16,76]{1,0} parameter(0)
  %param_1.524 = s64[16,76]{1,0} parameter(1)
  %convert.33 = s32[16,76]{1,0} convert(s64[16,76]{1,0} %param_1.524), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_7"}
  %compare.0 = pred[16,76]{1,0} compare(s32[16,76]{1,0} %param_0.605, s32[16,76]{1,0} %convert.33), direction=EQ, metadata={op_type="Equal" op_name="model/bert_pretrain_loss_and_metric_layer/Equal"}
  %param_2.376 = f32[16,76]{1,0} parameter(2)
  %convert.296 = s32[16,76]{1,0} convert(f32[16,76]{1,0} %param_2.376), metadata={op_type="Cast" op_name="model/Cast"}
  %convert.295 = f32[16,76]{1,0} convert(s32[16,76]{1,0} %convert.296), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast"}
  %constant_99 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.110 = f32[16,76]{1,0} broadcast(f32[] %constant_99), dimensions={}
  %select.19 = f32[16,76]{1,0} select(pred[16,76]{1,0} %compare.0, f32[16,76]{1,0} %convert.295, f32[16,76]{1,0} %broadcast.110), metadata={op_type="Mul" op_name="model/bert_pretrain_loss_and_metric_layer/mul_1"}
  %bitcast.137 = f32[1216]{0} bitcast(f32[16,76]{1,0} %select.19)
  %reduce.34 = f32[] reduce(f32[1216]{0} %bitcast.137, f32[] %constant_99), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_2-reduction.1872, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_2"}
  %bitcast.198.clone.1 = f32[1216]{0} bitcast(f32[16,76]{1,0} %convert.295)
  %reduce.58.clone.1 = f32[] reduce(f32[1216]{0} %bitcast.198.clone.1, f32[] %constant_99), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_3-reduction.210, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %param_3.336 = f32[1216]{0} parameter(3)
  %bitcast.140.clone.1 = f32[16,76]{1,0} bitcast(f32[1216]{0} %param_3.336), metadata={op_type="Reshape" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/Reshape_2"}
  %multiply.37.clone.1 = f32[16,76]{1,0} multiply(f32[16,76]{1,0} %convert.295, f32[16,76]{1,0} %bitcast.140.clone.1), metadata={op_type="Mul" op_name="model/bert_pretrain_loss_and_metric_layer/mul"}
  %bitcast.139.clone.1 = f32[1216]{0} bitcast(f32[16,76]{1,0} %multiply.37.clone.1)
  %reduce.36.clone.1 = f32[] reduce(f32[1216]{0} %bitcast.139.clone.1, f32[] %constant_99), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum-reduction.1818, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum"}
  ROOT %tuple.18 = (f32[], f32[], f32[]) tuple(f32[] %reduce.34, f32[] %reduce.58.clone.1, f32[] %reduce.36.clone.1)
}

%min_S64.1860 (lhs.1861: s64[], rhs.1862: s64[]) -> s64[] {
  %lhs.1861 = s64[] parameter(0)
  %rhs.1862 = s64[] parameter(1)
  ROOT %minimum.1863 = s64[] minimum(s64[] %lhs.1861, s64[] %rhs.1862)
}

%fused_computation.3 (param_0.654: f32[16,76], param_1.592: f32[30522], param_2.424: f16[1216,30528]) -> s64[16,76] {
  %param_2.424 = f16[1216,30528]{1,0} parameter(2)
  %slice.35 = f16[1216,30522]{1,0} slice(f16[1216,30528]{1,0} %param_2.424), slice={[0:1216], [0:30522]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/cls/predictions/MatMul"}
  %param_1.592 = f32[30522]{0} parameter(1)
  %convert.378 = f16[30522]{0} convert(f32[30522]{0} %param_1.592), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/BiasAdd/Cast"}
  %broadcast.623 = f16[1216,30522]{1,0} broadcast(f16[30522]{0} %convert.378), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %add.183 = f16[1216,30522]{1,0} add(f16[1216,30522]{1,0} %slice.35, f16[1216,30522]{1,0} %broadcast.623), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %convert.377 = f32[1216,30522]{1,0} convert(f16[1216,30522]{1,0} %add.183), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast_1"}
  %bitcast.277 = f32[16,76,30522]{2,1,0} bitcast(f32[1216,30522]{1,0} %convert.377), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_1"}
  %param_0.654 = f32[16,76]{1,0} parameter(0)
  %broadcast.112 = f32[16,76,30522]{2,1,0} broadcast(f32[16,76]{1,0} %param_0.654), dimensions={0,1}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %compare.1 = pred[16,76,30522]{2,1,0} compare(f32[16,76,30522]{2,1,0} %bitcast.277, f32[16,76,30522]{2,1,0} %broadcast.112), direction=EQ, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %iota.0 = s64[16,76,30522]{2,1,0} iota(), iota_dimension=2, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %constant_100 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %broadcast.111 = s64[16,76,30522]{2,1,0} broadcast(s64[] %constant_100), dimensions={}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  %select.20 = s64[16,76,30522]{2,1,0} select(pred[16,76,30522]{2,1,0} %compare.1, s64[16,76,30522]{2,1,0} %iota.0, s64[16,76,30522]{2,1,0} %broadcast.111), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
  ROOT %reduce.35 = s64[16,76]{1,0} reduce(s64[16,76,30522]{2,1,0} %select.20, s64[] %constant_100), dimensions={2}, to_apply=%min_S64.1860, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax"}
}

%add_float_.1004 (x.1005: f32[], y.1006: f32[]) -> f32[] {
  %x.1005 = f32[] parameter(0)
  %y.1006 = f32[] parameter(1)
  ROOT %add.1007 = f32[] add(f32[] %x.1005, f32[] %y.1006)
}

%fused_computation.7 (param_0.597: f32[1216], param_1.521: s32[16,76], param_2.373: f32[1216], param_3.255: f32[30522], param_4.156: f16[1216,30528]) -> f32[1216] {
  %param_1.521 = s32[16,76]{1,0} parameter(1)
  %convert.238 = f32[16,76]{1,0} convert(s32[16,76]{1,0} %param_1.521), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_2"}
  %convert.237 = s64[16,76]{1,0} convert(f32[16,76]{1,0} %convert.238), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_3"}
  %bitcast.251 = s64[1216]{0} bitcast(s64[16,76]{1,0} %convert.237), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_3"}
  %broadcast.443 = s64[1216,30522]{1,0} broadcast(s64[1216]{0} %bitcast.251), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.10 = s64[1216,30522]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.49 = pred[1216,30522]{1,0} compare(s64[1216,30522]{1,0} %broadcast.443, s64[1216,30522]{1,0} %iota.10), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_362 = f32[] constant(1), metadata={op_type="Minimum" op_name="Adam/PolynomialDecay/Minimum"}
  %broadcast.442 = f32[1216,30522]{1,0} broadcast(f32[] %constant_362), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_103 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.441 = f32[1216,30522]{1,0} broadcast(f32[] %constant_103), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.50 = f32[1216,30522]{1,0} select(pred[1216,30522]{1,0} %compare.49, f32[1216,30522]{1,0} %broadcast.442, f32[1216,30522]{1,0} %broadcast.441), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_360 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.439 = s64[1216]{0} broadcast(s64[] %constant_360), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.48 = pred[1216]{0} compare(s64[1216]{0} %broadcast.439, s64[1216]{0} %bitcast.251), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_359 = s64[] constant(30522), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.438 = s64[1216]{0} broadcast(s64[] %constant_359), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.47 = pred[1216]{0} compare(s64[1216]{0} %bitcast.251, s64[1216]{0} %broadcast.438), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %and.7 = pred[1216]{0} and(pred[1216]{0} %compare.48, pred[1216]{0} %compare.47), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.437 = f32[1216]{0} broadcast(f32[] %constant_103), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_358 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.436 = f32[1216]{0} broadcast(f32[] %constant_358), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.49 = f32[1216]{0} select(pred[1216]{0} %and.7, f32[1216]{0} %broadcast.437, f32[1216]{0} %broadcast.436), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.435 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %select.49), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %add.150 = f32[1216,30522]{1,0} add(f32[1216,30522]{1,0} %select.50, f32[1216,30522]{1,0} %broadcast.435), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.10 = f32[1216,30522]{1,0} negate(f32[1216,30522]{1,0} %add.150), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_4.156 = f16[1216,30528]{1,0} parameter(4)
  %slice.31 = f16[1216,30522]{1,0} slice(f16[1216,30528]{1,0} %param_4.156), slice={[0:1216], [0:30522]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/cls/predictions/MatMul"}
  %param_3.255 = f32[30522]{0} parameter(3)
  %convert.266 = f16[30522]{0} convert(f32[30522]{0} %param_3.255), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/BiasAdd/Cast"}
  %broadcast.525 = f16[1216,30522]{1,0} broadcast(f16[30522]{0} %convert.266), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %add.170 = f16[1216,30522]{1,0} add(f16[1216,30522]{1,0} %slice.31, f16[1216,30522]{1,0} %broadcast.525), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/cls/predictions/BiasAdd"}
  %convert.265 = f32[1216,30522]{1,0} convert(f16[1216,30522]{1,0} %add.170), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_float_Cast_1"}
  %param_2.373 = f32[1216]{0} parameter(2)
  %broadcast.523 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %param_2.373), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.39 = f32[1216,30522]{1,0} subtract(f32[1216,30522]{1,0} %convert.265, f32[1216,30522]{1,0} %broadcast.523), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.597 = f32[1216]{0} parameter(0)
  %broadcast.113 = f32[1216,30522]{1,0} broadcast(f32[1216]{0} %param_0.597), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.6 = f32[1216,30522]{1,0} subtract(f32[1216,30522]{1,0} %subtract.39, f32[1216,30522]{1,0} %broadcast.113), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.38 = f32[1216,30522]{1,0} multiply(f32[1216,30522]{1,0} %negate.10, f32[1216,30522]{1,0} %subtract.6), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %reduce.37 = f32[1216]{0} reduce(f32[1216,30522]{1,0} %multiply.38, f32[] %constant_103), dimensions={1}, to_apply=%add_float_.1004, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
}

%model_bert_pretrain_loss_and_metric_layer_Sum_6-reduction.725 (x.726: f32[], y.727: f32[]) -> f32[] {
  %x.726 = f32[] parameter(0)
  %y.727 = f32[] parameter(1)
  ROOT %add.728 = f32[] add(f32[] %x.726, f32[] %y.727)
}

%fused_computation.8 (param_0.13: f32[], param_1.284: s32[16,1], param_2.174: s64[16]) -> f32[] {
  %param_0.13 = f32[] parameter(0)
  %param_2.174 = s64[16]{0} parameter(2)
  %convert.36 = s32[16]{0} convert(s64[16]{0} %param_2.174), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_11"}
  %param_1.284 = s32[16,1]{1,0} parameter(1)
  %bitcast.141 = s32[16]{0} bitcast(s32[16,1]{1,0} %param_1.284), metadata={op_type="Squeeze" op_name="model/bert_pretrain_loss_and_metric_layer/Squeeze"}
  %compare.2 = pred[16]{0} compare(s32[16]{0} %convert.36, s32[16]{0} %bitcast.141), direction=EQ, metadata={op_type="Equal" op_name="model/bert_pretrain_loss_and_metric_layer/Equal_1"}
  %convert.35 = f32[16]{0} convert(pred[16]{0} %compare.2), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_12"}
  %constant_104 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %reduce.38 = f32[] reduce(f32[16]{0} %convert.35, f32[] %constant_104), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Sum_6-reduction.725, metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_6"}
  ROOT %add.41 = f32[] add(f32[] %param_0.13, f32[] %reduce.38), metadata={op_type="AssignAddVariableOp" op_name="model/bert_pretrain_loss_and_metric_layer/AssignAddVariableOp_4"}
}

%min_S64.714 (lhs.715: s64[], rhs.716: s64[]) -> s64[] {
  %lhs.715 = s64[] parameter(0)
  %rhs.716 = s64[] parameter(1)
  ROOT %minimum.717 = s64[] minimum(s64[] %lhs.715, s64[] %rhs.716)
}

%fused_computation.9 (param_0.556: f32[16], param_1.468: f32[2], param_2.325: f16[16,8]) -> s64[16] {
  %param_2.325 = f16[16,8]{1,0} parameter(2)
  %slice.15 = f16[16,2]{1,0} slice(f16[16,8]{1,0} %param_2.325), slice={[0:16], [0:2]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/classification/predictions/transform/logits/MatMul"}
  %param_1.468 = f32[2]{0} parameter(1)
  %convert.223 = f16[2]{0} convert(f32[2]{0} %param_1.468), metadata={op_type="Cast" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd/Cast"}
  %broadcast.408 = f16[16,2]{1,0} broadcast(f16[2]{0} %convert.223), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %add.138 = f16[16,2]{1,0} add(f16[16,2]{1,0} %slice.15, f16[16,2]{1,0} %broadcast.408), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %convert.37 = f32[16,2]{1,0} convert(f16[16,2]{1,0} %add.138), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_4"}
  %param_0.556 = f32[16]{0} parameter(0)
  %broadcast.177 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_0.556), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.3 = pred[16,2]{1,0} compare(f32[16,2]{1,0} %convert.37, f32[16,2]{1,0} %broadcast.177), direction=EQ, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %iota.1 = s64[16,2]{1,0} iota(), iota_dimension=1, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %constant_105 = s64[] constant(9223372036854775807), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %broadcast.114 = s64[16,2]{1,0} broadcast(s64[] %constant_105), dimensions={}, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  %select.22 = s64[16,2]{1,0} select(pred[16,2]{1,0} %compare.3, s64[16,2]{1,0} %iota.1, s64[16,2]{1,0} %broadcast.114), metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
  ROOT %reduce.39 = s64[16]{0} reduce(s64[16,2]{1,0} %select.22, s64[] %constant_105), dimensions={1}, to_apply=%min_S64.714, metadata={op_type="ArgMax" op_name="model/bert_pretrain_loss_and_metric_layer/ArgMax_1"}
}

%model_bert_pretrain_loss_and_metric_layer_Mean-reduction.854 (x.855: f32[], y.856: f32[]) -> f32[] {
  %x.855 = f32[] parameter(0)
  %y.856 = f32[] parameter(1)
  ROOT %add.857 = f32[] add(f32[] %x.855, f32[] %y.856)
}

%fused_computation.10 (param_0.564: f32[16], param_1.479: s32[16,1], param_2.337: f32[16], param_3.231: f32[2], param_4.127: f16[16,8]) -> f32[] {
  %param_1.479 = s32[16,1]{1,0} parameter(1)
  %convert.160 = f32[16,1]{1,0} convert(s32[16,1]{1,0} %param_1.479), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_5"}
  %convert.159 = s64[16,1]{1,0} convert(f32[16,1]{1,0} %convert.160), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_6"}
  %bitcast.229 = s64[16]{0} bitcast(s64[16,1]{1,0} %convert.159), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/ArithmeticOptimizer/ReorderCastLikeAndValuePreserving_int64_Cast_6"}
  %broadcast.296 = s64[16,2]{1,0} broadcast(s64[16]{0} %bitcast.229), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.6 = s64[16,2]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.25 = pred[16,2]{1,0} compare(s64[16,2]{1,0} %broadcast.296, s64[16,2]{1,0} %iota.6), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_259 = f32[] constant(1), metadata={op_type="Minimum" op_name="Adam/PolynomialDecay/Minimum"}
  %broadcast.294 = f32[16,2]{1,0} broadcast(f32[] %constant_259), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_107 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %broadcast.293 = f32[16,2]{1,0} broadcast(f32[] %constant_107), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %select.42 = f32[16,2]{1,0} select(pred[16,2]{1,0} %compare.25, f32[16,2]{1,0} %broadcast.294, f32[16,2]{1,0} %broadcast.293), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_256 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.292 = s64[16]{0} broadcast(s64[] %constant_256), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.24 = pred[16]{0} compare(s64[16]{0} %broadcast.292, s64[16]{0} %bitcast.229), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_255 = s64[] constant(2), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.291 = s64[16]{0} broadcast(s64[] %constant_255), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.23 = pred[16]{0} compare(s64[16]{0} %bitcast.229, s64[16]{0} %broadcast.291), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %and.3 = pred[16]{0} and(pred[16]{0} %compare.24, pred[16]{0} %compare.23), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.290 = f32[16]{0} broadcast(f32[] %constant_107), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_254 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.289 = f32[16]{0} broadcast(f32[] %constant_254), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %select.41 = f32[16]{0} select(pred[16]{0} %and.3, f32[16]{0} %broadcast.290, f32[16]{0} %broadcast.289), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.288 = f32[16,2]{1,0} broadcast(f32[16]{0} %select.41), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %add.104 = f32[16,2]{1,0} add(f32[16,2]{1,0} %select.42, f32[16,2]{1,0} %broadcast.288), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.11 = f32[16,2]{1,0} negate(f32[16,2]{1,0} %add.104), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_4.127 = f16[16,8]{1,0} parameter(4)
  %slice.21 = f16[16,2]{1,0} slice(f16[16,8]{1,0} %param_4.127), slice={[0:16], [0:2]}, metadata={op_type="MatMul" op_name="model/bert_pretrainer/classification/predictions/transform/logits/MatMul"}
  %param_3.231 = f32[2]{0} parameter(3)
  %convert.234 = f16[2]{0} convert(f32[2]{0} %param_3.231), metadata={op_type="Cast" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd/Cast"}
  %broadcast.420 = f16[16,2]{1,0} broadcast(f16[2]{0} %convert.234), dimensions={1}, metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %add.144 = f16[16,2]{1,0} add(f16[16,2]{1,0} %slice.21, f16[16,2]{1,0} %broadcast.420), metadata={op_type="BiasAdd" op_name="model/bert_pretrainer/classification/predictions/transform/logits/BiasAdd"}
  %convert.233 = f32[16,2]{1,0} convert(f16[16,2]{1,0} %add.144), metadata={op_type="Cast" op_name="model/bert_pretrain_loss_and_metric_layer/Cast_4"}
  %param_2.337 = f32[16]{0} parameter(2)
  %broadcast.419 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_2.337), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.31 = f32[16,2]{1,0} subtract(f32[16,2]{1,0} %convert.233, f32[16,2]{1,0} %broadcast.419), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.564 = f32[16]{0} parameter(0)
  %broadcast.115 = f32[16,2]{1,0} broadcast(f32[16]{0} %param_0.564), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.7 = f32[16,2]{1,0} subtract(f32[16,2]{1,0} %subtract.31, f32[16,2]{1,0} %broadcast.115), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.39 = f32[16,2]{1,0} multiply(f32[16,2]{1,0} %negate.11, f32[16,2]{1,0} %subtract.7), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="model/bert_pretrain_loss_and_metric_layer/SparseSoftmaxCrossEntropyWithLogits_1/SparseSoftmaxCrossEntropyWithLogits"}
  %bitcast.142 = f32[32]{0} bitcast(f32[16,2]{1,0} %multiply.39)
  ROOT %reduce.40 = f32[] reduce(f32[32]{0} %bitcast.142, f32[] %constant_107), dimensions={0}, to_apply=%model_bert_pretrain_loss_and_metric_layer_Mean-reduction.854, metadata={op_type="Mean" op_name="model/bert_pretrain_loss_and_metric_layer/Mean"}
}

%add_float_.1113 (x.1114: f32[], y.1115: f32[]) -> f32[] {
  %x.1114 = f32[] parameter(0)
  %y.1115 = f32[] parameter(1)
  ROOT %add.1116 = f32[] add(f32[] %x.1114, f32[] %y.1115)
}

%gradient_tape_model_bert_pretrainer_cls_predictions_transform_LayerNorm_batchnorm_sub_Sum-reduction.1793 (x.1794: f32[], y.1795: f32[]) -> f32[] {
  %x.1794 = f32[] parameter(0)
  %y.1795 = f32[] parameter(1)
  ROOT %add.1796 = f32[] add(f32[] %x.1794, f32[] %y.1795)
}

%gradient_tape_model_bert_pretrainer_cls_predictions_transform_LayerNorm_batchnorm_mul_Sum_1-reduction.1779 (x.1780: f32[], y.1781: f32[]) -> f32[] {
  %x.1780 = f32[] parameter(0)
  %y.1781 = f32[] parameter(1)
  ROOT %add.1782 = f32[] add(f32[] %x.1780, f32[] %y.1781)
}

%fused_computation.11 (param_0.658: f16[1216,768], param_1.599: f16[1216,768], param_2.434: f32[1216], param_3.325: f32[1216], param_4.234: f16[1216,768], param_5.157: f32[1216], param_6.93: f32[768], param_7.58: f32[1216], param_8.51: f16[1216,768]) -> (f32[768], f16[1216,768], f32[768], f32[768]) {
  %constant_168_clone_1 = f16[] constant(0.13416), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul_1"}
  %broadcast.124.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_168_clone_1), dimensions={}, metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul_1"}
  %param_1.599 = f16[1216,768]{1,0} parameter(1)
  %multiply.141.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %param_1.599, f16[1216,768]{1,0} %param_1.599), metadata={op_type="Square" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/Pow"}
  %param_8.51 = f16[1216,768]{1,0} parameter(8)
  %convert.89.clone.1 = f32[1216,768]{1,0} convert(f16[1216,768]{1,0} %param_8.51), metadata={op_type="Cast" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/Cast_1/Cast"}
  %constant_397_clone_1 = f32[] constant(1e-12), metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/add"}
  %broadcast.494.clone.1 = f32[1216]{0} broadcast(f32[] %constant_397_clone_1), dimensions={}, metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/add"}
  %param_7.58 = f32[1216]{0} parameter(7)
  %constant_392_clone_1 = f32[] constant(0.00130208337), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/truediv_1"}
  %broadcast.492.clone.1 = f32[1216]{0} broadcast(f32[] %constant_392_clone_1), dimensions={}
  %multiply.174.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %param_7.58, f32[1216]{0} %broadcast.492.clone.1), metadata={op_type="Mean" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/variance"}
  %add.154.clone.1 = f32[1216]{0} add(f32[1216]{0} %broadcast.494.clone.1, f32[1216]{0} %multiply.174.clone.1), metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/add"}
  %rsqrt.8.clone.1 = f32[1216]{0} rsqrt(f32[1216]{0} %add.154.clone.1), metadata={op_type="Rsqrt" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/Rsqrt"}
  %broadcast.230.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %rsqrt.8.clone.1), dimensions={0}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul"}
  %param_6.93 = f32[768]{0} parameter(6)
  %broadcast.229.clone.1 = f32[1216,768]{1,0} broadcast(f32[768]{0} %param_6.93), dimensions={1}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul"}
  %multiply.139.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %broadcast.230.clone.1, f32[1216,768]{1,0} %broadcast.229.clone.1), metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul"}
  %multiply.100.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %convert.89.clone.1, f32[1216,768]{1,0} %multiply.139.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul_1/Mul"}
  %constant_91_clone_1 = f32[] constant(2), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/Mul"}
  %broadcast.123.clone.1 = f32[1216,1]{1,0} broadcast(f32[] %constant_91_clone_1), dimensions={}
  %broadcast.122.clone.1 = f32[1216,1]{1,0} broadcast(f32[] %constant_392_clone_1), dimensions={}
  %bitcast.195.clone.1 = f32[1216,1]{1,0} bitcast(f32[1216]{0} %rsqrt.8.clone.1), metadata={op_type="Rsqrt" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/Rsqrt"}
  %multiply.99.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %bitcast.195.clone.1, f32[1216,1]{1,0} %bitcast.195.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %multiply.98.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %multiply.99.clone.1, f32[1216,1]{1,0} %bitcast.195.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %param_5.157 = f32[1216]{0} parameter(5)
  %constant_90_clone_1 = f32[] constant(-0.5)
  %broadcast.121.clone.1 = f32[1216]{0} broadcast(f32[] %constant_90_clone_1), dimensions={}
  %multiply.97.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %param_5.157, f32[1216]{0} %broadcast.121.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %bitcast.194.clone.1 = f32[1216,1]{1,0} bitcast(f32[1216]{0} %multiply.97.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %multiply.96.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %multiply.98.clone.1, f32[1216,1]{1,0} %bitcast.194.clone.1), metadata={op_type="RsqrtGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/RsqrtGrad"}
  %multiply.95.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %broadcast.122.clone.1, f32[1216,1]{1,0} %multiply.96.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/truediv"}
  %multiply.94.clone.1 = f32[1216,1]{1,0} multiply(f32[1216,1]{1,0} %broadcast.123.clone.1, f32[1216,1]{1,0} %multiply.95.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/Mul"}
  %bitcast.193.clone.1 = f32[1216]{0} bitcast(f32[1216,1]{1,0} %multiply.94.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/Mul"}
  %broadcast.120.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %bitcast.193.clone.1), dimensions={0}
  %param_4.234 = f16[1216,768]{1,0} parameter(4)
  %convert.250.clone.1 = f32[1216,768]{1,0} convert(f16[1216,768]{1,0} %param_4.234), metadata={op_type="Cast" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/Cast"}
  %param_3.325 = f32[1216]{0} parameter(3)
  %multiply.172.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %param_3.325, f32[1216]{0} %broadcast.492.clone.1), metadata={op_type="Mean" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/mean"}
  %broadcast.487.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %multiply.172.clone.1), dimensions={0}, metadata={op_type="SquaredDifference" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/SquaredDifference"}
  %subtract.35.clone.1 = f32[1216,768]{1,0} subtract(f32[1216,768]{1,0} %convert.250.clone.1, f32[1216,768]{1,0} %broadcast.487.clone.1), metadata={op_type="SquaredDifference" op_name="model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/SquaredDifference"}
  %multiply.93.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %broadcast.120.clone.1, f32[1216,768]{1,0} %subtract.35.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/mul_1"}
  %add.67.clone.1 = f32[1216,768]{1,0} add(f32[1216,768]{1,0} %multiply.100.clone.1, f32[1216,768]{1,0} %multiply.93.clone.1), metadata={op_type="AddN" op_name="AddN_1"}
  %param_2.434 = f32[1216]{0} parameter(2)
  %multiply.92.clone.1 = f32[1216]{0} multiply(f32[1216]{0} %broadcast.492.clone.1, f32[1216]{0} %param_2.434), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/moments/truediv_1"}
  %broadcast.119.clone.1 = f32[1216,768]{1,0} broadcast(f32[1216]{0} %multiply.92.clone.1), dimensions={0}
  %add.66.clone.1 = f32[1216,768]{1,0} add(f32[1216,768]{1,0} %add.67.clone.1, f32[1216,768]{1,0} %broadcast.119.clone.1), metadata={op_type="AddN" op_name="AddN_1"}
  %convert.88.clone.1 = f16[1216,768]{1,0} convert(f32[1216,768]{1,0} %add.66.clone.1), metadata={op_type="Cast" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/Cast/Cast"}
  %constant_170_clone_1 = f16[] constant(0.5), metadata={op_type="Mul" op_name="model/bert_pretrainer/bert_encoder_1/transformer/layer_0/activation/Gelu/mul"}
  %broadcast.232.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_170_clone_1), dimensions={}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul"}
  %multiply.140.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %param_1.599, f16[1216,768]{1,0} %broadcast.232.clone.1), metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul"}
  %multiply.91.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %convert.88.clone.1, f16[1216,768]{1,0} %multiply.140.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_3/Mul_1"}
  %constant_172_clone_1 = f16[] constant(1), metadata={op_type="Sub" op_name="model/bert_pretrainer/bert_encoder_1/transformer/layer_1/self_attention/softmax/sub"}
  %broadcast.234.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_172_clone_1), dimensions={}, metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/add_1"}
  %param_0.658 = f16[1216,768]{1,0} parameter(0)
  %multiply.90.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %param_0.658, f16[1216,768]{1,0} %param_0.658), metadata={op_type="TanhGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/TanhGrad"}
  %subtract.12.clone.1 = f16[1216,768]{1,0} subtract(f16[1216,768]{1,0} %broadcast.234.clone.1, f16[1216,768]{1,0} %multiply.90.clone.1), metadata={op_type="TanhGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/TanhGrad"}
  %multiply.89.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.91.clone.1, f16[1216,768]{1,0} %subtract.12.clone.1), metadata={op_type="TanhGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/TanhGrad"}
  %constant_171_clone_1 = f16[] constant(0.79785), metadata={op_type="Mul" op_name="model/bert_pretrainer/bert_encoder_1/transformer/layer_0/activation/Gelu/mul_2"}
  %broadcast.233.clone.1 = f16[1216,768]{1,0} broadcast(f16[] %constant_171_clone_1), dimensions={}, metadata={op_type="Mul" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_2"}
  %multiply.88.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.89.clone.1, f16[1216,768]{1,0} %broadcast.233.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_2/Mul"}
  %multiply.87.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.141.clone.1, f16[1216,768]{1,0} %multiply.88.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul"}
  %multiply.86.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %broadcast.124.clone.1, f16[1216,768]{1,0} %multiply.87.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/Pow/mul_1"}
  %multiply.85.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %convert.88.clone.1, f16[1216,768]{1,0} %broadcast.232.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul_3/Mul"}
  %add.95.clone.1 = f16[1216,768]{1,0} add(f16[1216,768]{1,0} %broadcast.234.clone.1, f16[1216,768]{1,0} %param_0.658), metadata={op_type="AddV2" op_name="model/bert_pretrainer/cls/predictions/transform/dense/Gelu/add_1"}
  %multiply.84.clone.1 = f16[1216,768]{1,0} multiply(f16[1216,768]{1,0} %multiply.85.clone.1, f16[1216,768]{1,0} %add.95.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/Gelu/mul/Mul"}
  %add.65.clone.1 = f16[1216,768]{1,0} add(f16[1216,768]{1,0} %multiply.86.clone.1, f16[1216,768]{1,0} %multiply.84.clone.1), metadata={op_type="AddN" op_name="AddN_2"}
  %add.64.clone.1 = f16[1216,768]{1,0} add(f16[1216,768]{1,0} %add.65.clone.1, f16[1216,768]{1,0} %multiply.88.clone.1), metadata={op_type="AddN" op_name="AddN_2"}
  %convert.38 = f32[1216,768]{1,0} convert(f16[1216,768]{1,0} %add.64.clone.1), metadata={op_type="BiasAddGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/BiasAdd/BiasAddGrad"}
  %constant_108 = f32[] constant(0), metadata={op_type="Sum" op_name="model/bert_pretrain_loss_and_metric_layer/Sum_3"}
  %reduce.41 = f32[768]{0} reduce(f32[1216,768]{1,0} %convert.38, f32[] %constant_108), dimensions={0}, to_apply=%add_float_.1113, metadata={op_type="BiasAddGrad" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/dense/BiasAdd/BiasAddGrad"}
  %reduce.43.clone.1 = f32[768]{0} reduce(f32[1216,768]{1,0} %convert.89.clone.1, f32[] %constant_108), dimensions={0}, to_apply=%gradient_tape_model_bert_pretrainer_cls_predictions_transform_LayerNorm_batchnorm_sub_Sum-reduction.1793, metadata={op_type="Sum" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/sub/Sum"}
  %multiply.201.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %convert.89.clone.1, f32[1216,768]{1,0} %convert.250.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul_1/Mul_1"}
  %negate.20.clone.1 = f32[1216,768]{1,0} negate(f32[1216,768]{1,0} %convert.89.clone.1), metadata={op_type="Neg" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/sub/Neg"}
  %multiply.199.clone.1 = f32[1216,768]{1,0} multiply(f32[1216,768]{1,0} %negate.20.clone.1, f32[1216,768]{1,0} %broadcast.487.clone.1), metadata={op_type="Mul" op_name="gradient_tape/model/bert_pretrainer/cls/predictions/transform/LayerNorm/batchnorm/mul_2/Mul_1"}
  %add.178.clone.1 = f32[1216,768]{1,0} add(f32[1216,768]{1,0} %multiply.201.clone.1, f32[1216,768]{1,0} %multiply.199.clone.1), metadata={op_type="AddN" op_name="AddN"}
